= Basic path expansion


    
[source,cypher]
----
MATCH (p:Person {name: "Praveena"})
CALL apoc.path.expand(p, "KNOWS", null, 1, 2)
YIELD path
RETURN path
----


.Results
[opts="header"]
|===
| path
| (:Person {name: "Praveena"})<-[:KNOWS]-(:Person {name: "Michael"})
| (:Person {name: "Praveena"})<-[:KNOWS]-(:Person {name: "Michael"})-[:KNOWS]->(:Person {name: "Lju"})
| (:Person {name: "Praveena"})<-[:KNOWS]-(:Person {name: "Michael"})-[:KNOWS]->(:Person {name: "Emil"})
|===

MATCH (p:Person {name: "Praveena"})
CALL apoc.path.expand(p, "KNOWS", null, 1, 2)
YIELD path
RETURN path