[[atomic-updates]]
= Atomic Property Updates
:description: This section describes algorithm that can be used for thread safe updating of properties on nodes and relationships.



Atomic procedures handle the concurrency, it's add a lock to the resource.
If two users access to the same resource at the same time, with the parameter `times` (default value 5) we can determine how many time retry to modify the resource, until the lock is release.

[separator=¦,opts=header,cols="5,1m,1m"]
|===
¦Qualified Name¦Type¦Release
include::example$generated-documentation/apoc.atomic.add.adoc[]
include::example$generated-documentation/apoc.atomic.subtract.adoc[]
include::example$generated-documentation/apoc.atomic.concat.adoc[]
include::example$generated-documentation/apoc.atomic.insert.adoc[]
include::example$generated-documentation/apoc.atomic.remove.adoc[]
include::example$generated-documentation/apoc.atomic.update.adoc[]
|===

.The following creates sample nodes:
[source, cypher]
----
CREATE (p:Person {name:'Tom',age: 40})
CREATE (p:Person {name:'Will',age: 35})
CREATE (p:Person {name:'David', children: ['Anne','Sam','Paul']})
CREATE (p:Person {name:'John', cars: ['Class A','X3','Focus']})
CREATE (p:Person {name:'Ryan', salary1:1800, salary2:1500})
----

.The following adds 10 to the property `age` for `Tom`:
[source,cypher]
----
MATCH (n:Person {name:'Tom'})
CALL apoc.atomic.add(n,'age',10,5)
YIELD oldValue, newValue
RETURN n
----

.Results
[opts="header",cols="1"]
|===
| n
| {"name":"Tom","age":50}
|===

.The following subtracts 10 from the property `age` for `Tom`:
[source,cypher]
----
MATCH (n:Person {name:'Tom'})
CALL apoc.atomic.subtract(n,'age',10,5)
YIELD oldValue, newValue
RETURN n
----

.Results
[opts="header",cols="1"]
|===
| n
| {"name":"Tom","age":40}
|===


.The following concatenates `iam` to the `name` property for `Will`:
[source,cypher]
----
MATCH (p:Person {name:'Will',age: 35})
CALL apoc.atomic.concat(p,"name",'iam',5)
YIELD newValue
RETURN p
----

.Results
[opts="header",cols="1"]
|===
| p
| {"name":"William","age":35}
|===


.The following adds `Mary` in position 2 of `children` list:
[source,cypher]
----
MATCH (p:Person {name:'David'})
CALL apoc.atomic.insert(p,'children',2,'Mary',5)
YIELD newValue
RETURN p
----

.Results
[opts="header",cols="1"]
|===
| p
| {"name":"David","children":["Anne","Sam","Mary","Paul"]}
|===

.The following removes the element `X3`, which is at position 1, from the array `cars`
[source,cypher]
----
MATCH (p:Person {name:'John'})
CALL apoc.atomic.remove(p,'cars',1,5)
YIELD newValue
RETURN p
----

.Results
[opts="header",cols="1"]
|===
| p
| {"name":"John","cars":["Class A","Focus"]}
|===

.The following updates `salary1` with the result of an expression:
[source,cypher]
----
MATCH (p:Person {name:'Ryan'})
CALL apoc.atomic.update(p,'salary1','n.salary1*3 + n.salary2',5)
YIELD newValue
RETURN p
----

The expression always have to be referenced with the `n.` that refers to the entity  passed as the first parameter.
If we rename our node/rel (as in the example above) we have anyway to refer to it in the expression as `n`.

.Results
[opts="header",cols="1"]
|===
| p
| {"name":"Ryan","salary1":6900,"salary2":1500}
|===