The examples in this section are based on the following graph:

[source,cypher]
----
CREATE (s:Student {name: 'Alice', score: 71});
CREATE (s:Student {name: 'Mark', score: 95});
CREATE (s:Student {name: 'Andrea', score: 86});
CREATE (s:Student {name: 'Rajesh', score: 89});
CREATE (s:Student {name: 'Jennifer', score: 96});
CREATE (s:Student {name: 'Katarina', score: 80});
----

If we create virtual nodes containing students scores, we can use `apoc.any.properties` to return the properties of those virtual nodes:

[source,cypher]
----
MATCH (s:Student)
CALL apoc.create.vNode(['Score'],{value: s.score})
YIELD node
RETURN apoc.any.properties(node) AS properties;
----

.Results
[opts="header"]
|===
| properties
| {value: 71}
| {value: 95}
| {value: 86}
| {value: 89}
| {value: 96}
| {value: 80}

|===