include::partial$triggers/triggersAdmonitions.adoc[]

The examples in this section are based on the following graph, created in 'neo4j' db:

[source,cypher]
----
CREATE (:Counter {count:0})
CREATE (f:Foo);
----

To create a trigger that keeps a count of the number of nodes that have been deleted, run the following query:

[source,cypher]
----
CALL apoc.trigger.install(
  'neo4j',
  'count-removals',
  'MATCH (c:Counter)
   SET c.count = c.count + size([f IN $deletedNodes WHERE id(f) > 0])',
  {}
);
----

.Results
[opts="header"]
|===
| name | query | selector | params | installed | paused
| "count-removals" | "MATCH (c:Counter) SET c.count = c.count + size([f IN $deletedNodes WHERE id(f) > 0])" | {} | {} | TRUE | FALSE
|===

After a time defined by the configuration `apoc.trigger.refresh`,
the `Foo` node will be deleted:

[source,cypher]
----
MATCH (f:Foo)
DELETE f;
----

.Results
[source,text]
----
0 rows available after 20 ms, consumed after another 0 ms
Deleted 1 nodes
----

And finally, let's check that the `count` property on our `Counter` node has been incremented:

[source,cypher]
----
MATCH (c:Counter)
RETURN c.count as count;
----

.Results
[opts="header"]
|===
| count
| 1
|===