The examples in this section are based on the following sample graph:

[source,cypher]
----
CREATE
  (a:Loc{name:'A'}), (b:Loc{name:'B'}),
  (c:Loc{name:'C'}), (d:Loc{name:'D'}),
  (a)-[:ROAD {d:100}]->(d),
  (a)-[:RAIL {d:5}]->(d), (a)-[:ROAD {d:10}]->(b),
  (b)-[:ROAD {d:20}]->(c),
  (c)-[:ROAD {d:30}]->(d),
  (a)-[:ROAD {d:20}]->(c);
----

We can find the shortest path from A to D, by running the following query:

[source,cypher]
----
MATCH (from:Loc{name:'A'}), (to:Loc{name:'D'})
CALL apoc.algo.dijkstra(from, to, 'ROAD>', 'd')
yield path, weight
RETURN path, weight;
----

.Results
[options="header", cols="3,1"]
|===
| path                                                                                                                                                                                                                           | weight
| (:Loc {name: "A"})-[:ROAD {d: 20}]->(:Loc {name: "C"})-[:ROAD {d: 30}]->(:Loc {name: "D"}) | 50.0
|===