The examples in this section are based on the following sample graph:

[source,cypher]
----
CREATE (:Person {name:'Tom',age: 40})
CREATE (:Person {name:'Will',age: 35})
CREATE (:Person {name:'David', children: ['Anne','Sam','Paul']})
CREATE (:Person {name:'John', cars: ['Class A','X3','Focus']})
CREATE (:Person {name:'Ryan', salary1:1800, salary2:1500});
----

.The following concatenates `iam` to the `name` property for `Will`:

[source,cypher]
----
MATCH (p:Person {name:'Will',age: 35})
CALL apoc.atomic.concat(p,"name",'iam',5)
YIELD oldValue, newValue
RETURN oldValue, newValue;
----

.Results
[opts="header"]
|===
| oldValue | newValue
| "Will"       | "William"
|===



