The examples in this section are based on the following graph:

[source,cypher]
----
CREATE (s:Student {name: 'Alice', score: 71});
CREATE (s:Student {name: 'Mark', score: 95});
CREATE (s:Student {name: 'Andrea', score: 86});
CREATE (s:Student {name: 'Rajesh', score: 89});
CREATE (s:Student {name: 'Jennifer', score: 96});
CREATE (s:Student {name: 'Katarina', score: 80});
----

If we create virtual nodes containing students scores, we can use `apoc.any.property` to extract a property from these virtual nodes:

[source,cypher]
----
MATCH (s:Student)
CALL apoc.create.vNode(['Score'],{value: s.score})
YIELD node
RETURN apoc.any.property(node, "value") AS score;
----

.Results
[opts="header"]
|===
| score
| 71
| 95
| 86
| 89
| 96
| 80
|===