The examples in this section are based on the following sample graph:

[source,cypher]
----
include::example$nlp-graph.cypher[]
----

We can use this procedure to  automatically store the sentiment and its score.

By default, a virtual graph is returned, but the graph can be persisted by specifying the `write: true` configuration.
The sentiment is stored in the `sentiment` property and the score for that sentiment in the `sentimentScore` property.

The following returns a graph with the sentiment for the Pokemon article:

[source,cypher]
----
MATCH (a:Article {uri: "https://neo4j.com/blog/pokegraph-gotta-graph-em-all/"})
CALL apoc.nlp.aws.sentiment.graph(a, {
  key: $apiKey,
  secret: $apiSecret,
  nodeProperty: "body",
  write: true
})
YIELD graph AS g
UNWIND g.nodes AS node
RETURN node {.uri, .sentiment, .sentimentScore} AS node;
----

.Results
[opts="header"]
|===
| node
| {sentiment: "Positive", sentimentScore: 0.6660025119781494, uri: "https://neo4j.com/blog/pokegraph-gotta-graph-em-all/"}
|===


If we want to stream back the sentiment and apply custom logic to the results, see xref::overview/apoc.nlp/apoc.nlp.aws.sentiment.stream.adoc[].