[[clone-nodes]]
= Clone nodes
:description: This section describes procedures that can be used to clone nodes and relationships.



The available procedures are described in the table below:
[separator=¦,opts=header,cols="5,1m,1m"]
|===
¦Qualified Name¦Type¦Release
include::example$generated-documentation/apoc.refactor.cloneNodes.adoc[]
|===

== Example Usage

The examples below will help us learn how to use these procedures.

=== Clone nodes only

.The following creates a graph with two nodes, Foo and Bar:
[source,cypher]
----
CREATE (f:Foo{name:'Foo'}),(b:Bar{name:'Bar'})
----

image::apoc.refactor.cloneNodes.dataset.png[scaledwidth="100%"]

.The following creates copies of both of these nodes:
[source,cypher]
----
MATCH (f:Foo{name:'Foo'}),(b:Bar{name:'Bar'})
CALL apoc.refactor.cloneNodes([f,b])
YIELD input, output, error
RETURN *
----

where `input` is the source node id, `output` is the node cloned and `error` is the possible error message.

If we execute this query, it will result in the following graph:

image::apoc.refactor.cloneNodes.png[scaledwidth="100%"]

In case of an error, the message will be thrown in the `error` result, for example with this constraint:
[source,cypher]
----
CREATE CONSTRAINT ON (n:UniqueLabel) ASSERT n.key IS UNIQUE
----

We can create this node:

[source,cypher]
----
CREATE (:UniqueLabel {key: 1})
----

and then we can execute:

[source,cypher]
----
MATCH (n:UniqueLabel) WITH n
CALL apoc.refactor.cloneNodes([n]) 
YIELD error, output
RETURN error, output
----

getting as a result:

.Results
[opts="header",cols="1"]
|===
| error | output
| "Node(<NNN>) already exists with label &#96;UniqueLabel&#96; and property &#96;key&#96; = 1" | null
|===

=== Clone nodes skipping properties

We can clone nodes excluding some properties, by specifying the `propertyKey`s list as the third parameter
For example, with this node:

[source,cypher]
----
CREATE (f:Foo{name:'Bar', surname: 'Baz', age: 66})
----

we can execute:
[source,cypher]
----
MATCH (n:Foo)
CALL apoc.refactor.cloneNodes([n], false, ["age"])
YIELD output 
RETURN properties(output) AS props
----

.Results
[opts="header",cols="1"]
|===
| props
| { "surname": "Baz", "name": "Bar" }
|===
