[[invert-relationship]]
= Invert relationship
:description: This section describes a procedure that can be used to invert the direction of relationships.



The available procedure is described in the table below:

[separator=¦,opts=header,cols="5,1m,1m"]
|===
¦Qualified Name¦Type¦Release
include::example$generated-documentation/apoc.refactor.invert.adoc[]
|===


== Example Usage

The example below will help us learn how to use this procedure.

.The following creates a graph containing two nodes connected by a relationship:

[source,cypher]
----
CREATE path=(c:Car {make:"Volvo"})-[rel:DRIVES {year:2001}]->(p:Person {name:"Dan"}) RETURN path
----

image::apoc.refactor.invert.dataset.png[scaledwidth="100%"]

.The following inverts the direction of the relationship:
[source,cypher]
----
MATCH (c:Car)-[rel:DRIVES]->(p:Person)
CALL apoc.refactor.invert(rel)
yield input, output
RETURN input, output
----

.Results
[opts="header",cols="2"]
|===
| input |	output
| 2 | {"identity":3,"start":9,"end":8,"type":"DRIVES","properties":{"year":2001}}
|===


If we execute `MATCH path=(c:Car {make:"Volvo"})-[rel:DRIVES {year:2001}]-(p:Person {name:"Dan"}) RETURN path`, 
it will result in the following graph:

image::apoc.refactor.invert.png[scaledwidth="100%"]
