[[mqtt]]
= Neo4j MqTT Cypher Client

[abstract]
--
MqTT publish subscribe from Neo4j to MqTT broker
--

[NOTE]
====
 based on org.eclipse.paho.client.mqttv3 library 
 tested with Eclipse Mosquitto 1.5.8 MqTT broker
====

// end::mqtt[]

== Managing MqTT brokers

MqTT broker - add, list, delete
[source,cypher]
----
// --- Register MqTT Broker ---
// all values under connect options are optional - default values are shown
RETURN apoc.mqtt.addBroker(
 'mqttBrokerId', 
 {
    serverURI:'tcp://localhost:1883',
    clientId:'mqttBrokerId'+'Client'+random,
    qos:0, 
    automaticReconnect:true, 
    cleanSession:false, 
    connectionTimeout:1  
 }
)

// --- List MqTT Brokers ---
// basic statistics are shown
RETURN apoc.mqtt.listBrokers()

// --- List MqTT Brokers vNode returned ---
// basic statistics are shown
RETURN apoc.mqtt.listBrokersAsVnode()

// --- Remove MqTT Broker ---
RETURN apoc.mqtt.deleteBroker('mqttBrokerLocalhost')
----

Neo4j MqTT broker registration response messages
[source,cypher]
----
// --- succesful mqtt registration ---
{
  "mqttBrokerId": "mqttLocalhostBroker",
  "serverURI": "tcp://localhost:1883",
  "statusMessage": "Connect MqTT OK",
  "status": "ok"
}

// --- failed mqtt registration ---
{
  "mqttBrokerId": "mqttLocalhostBroker",
  "serverURI": "tcp://localhost:1883",
  "statusMessage": "Broker with this name exists!",
  "status": "error"
}

// --- failed mqtt registration ---
{
  "mqttBrokerId": "mqttLocalhostBrokerError",
  "serverURI": "tcp://localhostNotExists:1883",
  "statusMessage": "Failed to Connect MqTT Broker: MqttException",
  "status": "error"
}
----

== MqTT publish
MqTT publish from Neo4j
[source,cypher]
----
// --- Publish MqTT message ---
RETURN apoc.mqtt.publish(
    'mqttBrokerId', 
    'mqtt/topic/path', 
    {mqttMessageValue:"message as json or value"}, 
    {options:"options - currently not used"}
)
----

Neo4j MqTT publish response messages
[source,bash]
----
// --- succesful mqtt publish ---
{
  "options": {

  },
  "mqttBrokerId": "mqttLocalhostBroker",
  "topic": "mqtt/topic/json",
  "message": {
    "string": "string",
    "int": 123,
    "boolean": true
  },
  "statusMessage": "MqTT Publish OK",
  "status": "ok"
}

// --- failed mqtt publish ---
{
  "options": {

  },
  "mqttBrokerId": "mqttLocalhostBrokerNotExist",
  "topic": "mqtt/topic/json",
  "message": {
    "string": "string",
    "int": 123,
    "boolean": true
  },
  "statusMessage": "Failed to find MqTT Broker - Check Connection",
  "status": "error"
}

----

== MqTT subscribe
Subscribe, list, unsubscribe MqTT topics and run Neo4j cypher
[source,cypher]
----
// --- Subscribe to MqTT Topic Procedure ---
CALL apoc.mqtt.subscribe(
    'mqttBrokerId', 
    'mqtt/topic/path',
    'MERGE (n:CypherMqttCreated) 
        ON CREATE SET n.count=1, n.mqttMessageValue=$mqttMessageValue 
        ON MATCH SET n.count = n.count +1, n.mqttMessageValue=$mqttMessageValue 
     RETURN n', 
    {messageType:'json'}
 )

// --- List Subscriptions ---
// basic subscription statistics are shown
RETURN apoc.mqtt.listSubscriptions('optionalBrokerIdDefaultToAll')

// --- List Subscriptions vNode Returned ---
// basic subscription statistics are shown
RETURN apoc.mqtt.listSubscriptionsAsVnode('optionalBrokerIdDefaultToAll')

// --- Remove MqTT subscription ---
RETURN apoc.mqtt.unSubscribe('mqttBrokerId', '/mqtt/topic/path' )
----


== Examples
=== Add MqTT broker connection and publish
[NOTE]
====
 MqTT broker should be operational!
====


Start Mosquitto MqTT subscription client
[source,bash]
----
mosquitto_sub  --verbose --host localhost --port 1883 --topic mqtt/topic/# --id msqSub

----

Register localhost MqTT broker via Neo4j console
[source,cypher]
----
RETURN apoc.mqtt.addBroker(
 'mqttLocalhostBroker', 
 {
    serverURI:'tcp://localhost:1883',
    clientId:'neo4jClient01'
  }
)
----

Publish MqTT messages via Neo4j console
[source,cypher]
----
// --- json ---
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/json', 
    {
        string:"string",
        int:123,
        boolean:true
    }
)

// --- string value ---
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/valueString', 
    "stringValue"
)

// --- integer value ---
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/valueInteger', 
    123
)

// --- number value ---
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/valueNumber', 
    123.456
)

// --- boolean value ---
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/valueBoolean', 
    true
)

// --- Neo4j node ---
CREATE (neo4jNode:TestMqttNode:TestNode {string:"string", int:123, boolean:true})
WITH neo4jNode
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/neo4jNode', 
    neo4jNode
)

// --- Neo4j relation ---
CREATE (s)-[r:TEST_MQTT_RELATION {string:"string", int:123, boolean:true}]->(e) 
WITH r AS neo4jRelation
RETURN apoc.mqtt.publish(
    'mqttLocalhostBroker', 
    'mqtt/topic/neo4jRelation', 
    neo4jRelation
)

----

Check MqTT messages received by Mosquitto MqTT client
[source,bash]
----
mosquitto_sub  --verbose --host localhost --port 1883 --topic mqtt/topic/# --id msqSub
mqtt/topic/json {"boolean":true,"string":"string","int":123}
mqtt/topic/valueString stringValue
mqtt/topic/valueInteger 123
mqtt/topic/valueNumber 123.456
mqtt/topic/valueBoolean true
mqtt/topic/neo4jNode {"id":80,"properties":{"boolean":true,"string":"string","int":123},"labels":"TestMqttNode:TestNode"}
mqtt/topic/neo4jRelation {"startNodeId":60,"id":8,"type":"TEST_MQTT_RELATION","endNodeId":61,"properties":{"boolean":true,"string":"string","int":123}}

----





=== Add MqTT broker connection and subscribe

Register localhost MqTT broker via Neo4j console
[source,cypher]
----
RETURN apoc.mqtt.addBroker(
 'mqttLocalhostBroker', 
 {
    serverURI:'tcp://localhost:1883',
    clientId:'neo4jClient01'
  }
)
----

Subscribe to MqTT messages via Neo4j console
[source,cypher]
----
// --- json mqtt message subscription ---
CALL apoc.mqtt.subscribe(
    'mqttLocalhostBroker', 
    'mqtt/topic/json',
    'MERGE (n:MqttCreatedNodeJson) 
        ON CREATE SET 
            n.count=1, 
            n.string=$string,
            n.int=$int,
            n.boolean=$boolean
        ON MATCH SET 
            n.count = n.count +1, 
            n.string=$string,
            n.int=$int,
            n.boolean=$boolean 
     RETURN n'
 )
 
 // --- "value" mqtt message subscription ---
 CALL apoc.mqtt.subscribe(
    'mqttLocalhostBroker', 
    'mqtt/topic/value/#',
    'CREATE (n:MqttCreatedNodeValue) SET  n.value=$value   RETURN n'
 )

----
 
 
Send MqTT messages
[source,bash]
----
# send json message
mosquitto_pub  --id msqPub --host localhost --port 1883 --topic mqtt/topic/json --message "{\"string\":\"string\",\"int\":123,\"boolean\":true}" 
# send "value" message
mosquitto_pub  --id msqPub --host localhost --port 1883 --topic mqtt/topic/value/string --message "string"
mosquitto_pub  --id msqPub --host localhost --port 1883 --topic mqtt/topic/value/int --message 123
mosquitto_pub  --id msqPub --host localhost --port 1883 --topic mqtt/topic/value/float --message 123.456
----

 
 
Check Subscriptions
[source,bash]
----
// --- list subscriptions 
RETURN apoc.mqtt.listSubscriptions()
 
// --- expected response 
[
{
  "mqttBrokerId": "mqttLocalhostBroker",
  "topic": "mqtt/topic/json",
  "type": "MqttSubscription",
  "subscribeOptions": {
    "lastMessageReceived": "{"string":"string","int":123,"boolean":true}",
    "lastMessageProcessedResults": "org.neo4j.graphdb.TransactionFailureException: Transaction was marked as successful, but unable to commit transaction so rolled back.",
    "messageReceivedOk": 1,
    "messageType": "json",
    "messageReceivedError": 1,
    "query": "MERGE (n:MqttCreatedNodeJson)
        ON CREATE SET
            n.count=1,
            n.string=$string,
            n.int=$int,
            n.boolean=$boolean
        ON MATCH SET
            n.count = n.count +1,
            n.string=$string,
            n.int=$int,
            n.boolean=$boolean
     RETURN n"
  }
}
,
{
  "mqttBrokerId": "mqttLocalhostBroker",
  "topic": "mqtt/topic/value/#",
  "type": "MqttSubscription",
  "subscribeOptions": {
    "lastMessageReceived": "123.456",
    "lastMessageProcessedResults": "+----------------------------+
| n                          |
+----------------------------+
| Node[125]{value:"123.456"} |
+----------------------------+
1 row
Nodes created: 1
Properties set: 1
Labels added: 1
",
    "messageReceivedOk": 3,
    "messageType": "json",
    "messageReceivedError": 0,
    "query": "CREATE (n:MqttCreatedNodeValue) SET  n.value=$value   RETURN n"
  }
}
]
----

Check Nodes
----
// --- get created nodes
MATCH (n) 
WHERE n:MqttCreatedNodeJson OR n:MqttCreatedNodeValue
RETURN {id:id(n), labels:labels(n), properties:properties(n)}

// --- response
{id:id(n), labels:labels(n), properties:properties(n)}
{
  "id": 82,
  "properties": {
    "boolean": true,
    "string": "string",
    "count": 1,
    "int": 123.0
  },
  "labels": [
    "MqttCreatedNodeJson"
  ]
}
{
  "id": 102,
  "properties": {
    "value": "string"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
{
  "id": 121,
  "properties": {
    "value": "123"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
{
  "id": 122,
  "properties": {
    "value": "123.456"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
{
  "id": 123,
  "properties": {
    "value": "string"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
{
  "id": 124,
  "properties": {
    "value": "123"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
{
  "id": 125,
  "properties": {
    "value": "123.456"
  },
  "labels": [
    "MqttCreatedNodeValue"
  ]
}
----
