<style type="text/css" media="screen">
/*
.nodes-image {
	margin:-100;
}
*/	
@import url("//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css");

.imageblock .content img, .image img {max-width: 900px;max-height: 300px;}
.deck h3, .deck h4 {display: block !important;margin-bottom:8px;margin-top:5px;}
.listingblock {margin:8px;}
.pull-bottom {position:relative;bottom:1em;}
.admonitionblock td.icon [class^="fa icon-"]{font-size:2.5em;text-shadow:1px 1px 2px rgba(0,0,0,.5);cursor:default}
.admonitionblock td.icon .icon-note:before{content:"\f05a";color:#19407c}
.admonitionblock td.icon .icon-tip:before{content:"\f0eb";text-shadow:1px 1px 2px rgba(155,155,0,.8);color:#111}
.admonitionblock td.icon .icon-warning:before{content:"\f071";color:#bf6900}
.admonitionblock td.icon .icon-caution:before{content:"\f06d";color:#bf3400}
.admonitionblock td.icon .icon-important:before{content:"\f06a";color:#bf0000}
.admonitionblock.note.speaker { display:none; }
</style>
<style type="text/css" media="screen">
#editor.maximize-editor .CodeMirror-code { font-size:24px; line-height:26px; }
</style>
<article class="guide" ng-controller="AdLibDataController">
  <carousel class="deck container-fluid">
    <!--slide class="row-fluid">
      <div class="col-sm-3">
        <h3>APOC User Guide</h3>
        <p class="lead">Information</p>
			<!dl>
				
				
				
				
				
			</dl>
		</div>
      <div class="col-sm-9">
        <figure>
          <img style="width:300px" src=""/>
        </figure>
      </div>
    </slide-->
    


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Introduction</h3>
    <br/>
    <div>
      <div class="imageblock" style="float: right">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/docs/{img}/apoc.gif" alt="apoc">
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>License</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Apache License 2.0</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>"APOC" Name history</h3>
    <br/>
    <div>
      <div class="paragraph">
<p><a href="http://matrix.wikia.com/wiki/Apoc">Apoc</a> was the technician and driver on board of the Nebuchadnezzar in the Matrix movie. He was killed by Cypher.</p>
</div>
<div class="paragraph">
<p><strong>APOC</strong> was also the first bundled <a href="http://neo4j.com/blog/convenient-package-neo4j-apoc-0-1-released/">A Package Of Components</a> for Neo4j in 2009.</p>
</div>
<div class="paragraph">
<p><strong>APOC</strong> also stands for "Awesome Procedures On Cypher"</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Download latest release (for the regular user)</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Go to <a href="http://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/latest" class="bare">http://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/latest</a>
to find the latest release and download the binary jar to place into your $NEO4J_HOME/plugins folder.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Build &amp; install the current development branch from source</h3>
    <br/>
    <div>
      <div class="listingblock">
<div class="content">
<pre>git clone http://github.com/neo4j-contrib/neo4j-apoc-procedures
./gradlew shadow
cp build/libs/apoc-&lt;version&gt;-SNAPSHOT-extended.jar $NEO4J_HOME/plugins/
$NEO4J_HOME/bin/neo4j restart</pre>
</div>
</div>
<div class="paragraph">
<p>A full build including running the tests can be run by <code>./gradlew build</code>.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Calling Procedures within Cypher</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Procedures can be called stand-alone with <code>CALL procedure.name();</code></p>
</div>
<div class="paragraph">
<p>But you can also integrate them into your Cypher statements which makes them so much more powerful.</p>
</div>
<div class="listingblock">
<div class="title">Load JSON example</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->WITH 'https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/person.json' AS url

CALL apoc.load.json(url) YIELD value as person

MERGE (p:Person {name:person.name})
   ON CREATE SET p.age = person.age, p.children = size(person.children)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Overview of APOC Procedures</h3>
    <br/>
    <div>
      
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Manual Indexes</h3>
    <br/>
    <div>
      


   <h4>Index Queries</h4>
   <div class="paragraph">
<p>Procedures to add to and query manual indexes</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
Please note that there are (case-sensitive) <a href="http://neo4j.com/docs/developer-manual/current/#cypher-schema">automatic schema indexes</a>, for equality, non-equality, existence, range queries, starts with, ends-with and contains!
</td>
</tr>
</table>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addAllNodes('index-name',{label1:['prop1',&#8230;&#8203;],&#8230;&#8203;})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add all nodes to this full text index with the given fields, additionally populates a 'search' index field with all of them in one place</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNode(node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for each label it has</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByLabel(node,'Label',['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given label</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationship(rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for its type</p></td>
</tr>
</tbody>
</table>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/{img}/apoc.index.nodes-with-score.jpg" alt="apoc.index.nodes with score" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.search('index-name', 'query') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">search for the first 100 nodes in the given full text index matching the given lucene query returned by relevance</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.nodes('Label','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on node index with the given label name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.relationships('TYPE','prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.between(node1,'TYPE',node2,'prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name bound by either or both sides (each node parameter can be null)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.out(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>outgoing</strong> relationship of the given node, <strong>returns end-nodes</strong></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.in(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>incoming</strong> relationship of the given node, <strong>returns start-nodes</strong></p></td>
</tr>
</tbody>
</table>



   <h4>Index Management</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.list() YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lists all manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.remove('name') YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">removes manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forNodes('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual node index</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forRelationships('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual relationship index</p></td>
</tr>
</tbody>
</table>
<div class="listingblock">
<div class="title">Add node to index example</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->match (p:Person) call apoc.index.addNode(p,["name","age"]) RETURN count(*);
// 129s for 1M People
call apoc.index.nodes('Person','name:name100*') YIELD node, weight return * limit 2<!--/code--></pre>
</div>
</div>



   <h4>Schema Index Queries</h4>
   <div class="paragraph">
<p>Schema Index lookups that keep order and can apply limits</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.orderedRange(label,key,min,max,sort-relevance,limit) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">schema range scan which keeps index order and adds limit, values can be null, boundaries are inclusive</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.orderedByText(label,key,operator,value,sort-relevance,limit) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">schema string search which keeps index order and adds limit, operator is 'STARTS WITH' or 'CONTAINS'</p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Export / Import</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Data is exported as cypher statements (for neo4j-shell, and partly apoc.cypher.runFile to the given file.</p>
</div>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Loading Data from RDBMS</h3>
    <br/>
    <div>
      <div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/{img}/apoc-jdbc-northwind-load.jpg" alt="apoc jdbc northwind load" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','SELECT * FROM PERSON WHERE AGE &gt; 18')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.driver('org.apache.derby.jdbc.EmbeddedDriver')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">register JDBC driver of source database</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>To simplify the JDBC URL syntax, for example 'jdbc:derby:derbyDB', and so as to mask the details one can define in conf/neo4j.conf</p>
</div>
<div class="listingblock">
<div class="content">
<pre>apoc.jdbc.derby.url=jdbc:derby:derbyDB</pre>
</div>
</div>
<div class="paragraph">
<p>and then</p>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</pre>
</div>
</div>
<div class="paragraph">
<p>becomes</p>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('derby','PERSON') YIELD row CREATE (:Person {name:row.name})</pre>
</div>
</div>
<div class="paragraph">
<p>The 3rd value in the 'apoc.jdbc.derby.url=' effectively defines an &lt;alias&gt; to be used in the apoc.load.jdbc('&lt;alias&gt;',&#8230;&#8203;.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Loading Data from Web-APIs (JSON, XML, CSV)</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.xml('http://example.com/test.xml') YIELD value as doc CREATE (p:Person) SET p.name = doc.name</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from XML URL (e.g. web-api) to import XML as single nested map with attributes and <code>_type</code>, <code>_text</code> and <code>_children</code> fields.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.csv('url',{sep:";"}) YIELD lineNo, list, map</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load CSV fom URL as stream of values<br>
config contains any of: <code>{skip:1,limit:5,header:false,sep:'TAB',ignore:['tmp'],arraySep:';',mapping:{years:{type:'int',arraySep:'-',array:false,name:'age',ignore:false}}</code></p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Interacting with Elastic Search</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.stats(host-url-Key)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">elastic search statistics</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.get(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.query(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a SEARCH operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.getRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.postRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.post(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.put(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a PUT operation</p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Interacting with Couchbase</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.get(nodes, bucket, documentId) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Retrieves a couchbase json document by its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.exists(nodes, bucket, documentId) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Check whether a couchbase json document with the given ID does exist</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.insert(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Insert a couchbase json document with its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.upsert(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Insert or overwrite a couchbase json document with its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.append(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Append a couchbase json document to an existing one</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.prepend(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Prepend a couchbase json document to an existing one</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.remove(nodes, bucket, documentId) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Remove the couchbase json document identified by its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.replace(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Replace the content of the couchbase json document identified by its unique ID.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.query(nodes, bucket, statement) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a plain un-parameterized N1QL statement.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.posParamsQuery(nodes, bucket, statement, params) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a N1QL statement with positional parameters.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.namedParamsQuery(nodes, bucket, statement, paramNames, paramValues) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a N1QL statement with named parameters.</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>Copy these jars into the plugins directory:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>mvn dependency:copy-dependencies
cp target/dependency/java-client-2.3.1.jar target/dependency/core-io-1.3.1.jar target/dependency/rxjava-1.1.5.jar $NEO4J_HOME/plugins/</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.couchbase.get(['localhost'], 'default', 'artist:vincent_van_gogh')<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Streaming Data to Gephi</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.gephi.add(url-or-key, workspace, data)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">streams provided data to Gephi</p></td>
</tr>
</tbody>
</table>



   <h4>Notes</h4>
   <div class="paragraph">
<p>Gephi has a <a href="https://marketplace.gephi.org/plugin/graph-streaming/">streaming plugin</a>, that can provide and accept <a href="https://github.com/gephi/gephi/wiki/GraphStreaming#Gephi_as_Master">JSON-graph-data</a> in a streaming fashion.</p>
</div>
<div class="paragraph">
<p>Make sure to install the plugin firsrt and activate it for your workspace (there is a new "Streaming"-tab besides "Layout"), right-click "Master"&#8594;"start" to start the server.</p>
</div>
<div class="paragraph">
<p>You can provide your workspace name (you might want to rename it before you start thes streaming), otherwise it defaults to <code>workspace0</code></p>
</div>
<div class="paragraph">
<p>The default Gephi-URL is <a href="http://localhost:8080" class="bare">http://localhost:8080</a>, resulting in <code><a href="http://localhost:8080/workspace0?operation=updateGraph" class="bare">http://localhost:8080/workspace0?operation=updateGraph</a></code></p>
</div>
<div class="paragraph">
<p>You can also configure it in <code>conf/neo4j.conf</code> via  <code>apoc.gephi.url=url</code> or <code>apoc.gephi.&lt;key&gt;.url=url</code></p>
</div>



   <h4>Example</h4>
   <div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->match path = (:Person)-[:ACTED_IN]-&gt;(:Movie)
WITH path LIMIT 1000
with collect(path) as paths
call apoc.gephi.add(null,'workspace0', paths) yield nodes, relationships, time
return nodes, relationships, time<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Generating Graphs</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Generate undirected (random direction) graphs with semi-real random distributions based on theoretical models.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.er(noNodes, noEdges, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Erdos-Renyi model (uniform)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.ws(noNodes, degree, beta, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Watts-Strogatz model (clusters)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.ba(noNodes, edgesPerNode, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Barabasi-Albert model (preferential attachment)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.complete(noNodes, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a complete graph (all nodes connected to all other nodes)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.simple([degrees], 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph with the given degree distribution</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>Example</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.generate.ba(1000, 2, 'TestLabel', 'TEST_REL_TYPE')
CALL apoc.generate.ws(1000, null, null, null)
CALL apoc.generate.simple([2,2,2,2], null, null)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Monitoring</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>(thanks @ikwattro)</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.ids</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">node and relationships-ids in total and in use</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.kernel</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store information such as kernel version, start time, read-only, database-name, store-log-version etc.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.store</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store size information for the different types of stores</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.tx</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">number of transactions total,opened,committed,concurrent,rolled-back,last-tx-id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.locks(minWaitTime long)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">db locking information such as avertedDeadLocks, lockCount, contendedLockCount and contendedLocks etc. (enterprise)</p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Cypher Execution</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.runFile(file or url) yield row, result</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">runs each statement in the file, all semicolon separated - currently no schema operations</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.mapParallel(fragment, params, list-to-parallelize) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">executes fragment in parallel batches with the list segments being assigned to _</p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>

<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Helpers</h3>
    <br/>
    <div>

   <h4>Lookup Functions</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.get.nodes(node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[ids]) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">quickly returns all nodes with these id&#8217;s</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.get.rels(rels</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[ids]) yield rel</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">quickly returns all relationships with these id&#8217;s</p></td>
</tr>
</tbody>
</table>

   <h4>Relationship Filter</h4>
   <div class="paragraph">
<p>Syntax: <code>[&lt;]RELATIONSHIP_TYPE1[&gt;]|[&lt;]RELATIONSHIP_TYPE2[&gt;]|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">type</th>
<th class="tableblock halign-left valign-top">direction</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>OUTGOING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>INCOMING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>BOTH</p>
</div></div></td>
</tr>
</tbody>
</table>



   <h4>Label Filter</h4>
   <div class="paragraph">
<p>Syntax: <code>[+-/]LABEL1|LABEL2|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">label</th>
<th class="tableblock halign-left valign-top">result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>+Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>include label (whitelist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-Foe</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Foe</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>exclude label (blacklist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>/Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div class="paragraph">
<p>stop traversal after reaching a friend (but include him)</p>
</div></div></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>

<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Text and Lookup Indexes</h3>
    <br/>
    <div>
      


   <h4>Index Queries</h4>
   <div class="paragraph">
<p>Procedures to add to and query manual indexes</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
Please note that there are (case-sensitive) <a href="http://neo4j.com/docs/developer-manual/current/#cypher-schema">automatic schema indexes</a>, for equality, non-equality, existence, range queries, starts with, ends-with and contains!
</td>
</tr>
</table>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addAllNodes('index-name',{label1:['prop1',&#8230;&#8203;],&#8230;&#8203;})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add all nodes to this full text index with the given fields, additionally populates a 'search' index field with all of them in one place</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNode(node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for each label it has</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByLabel(node,'Label',['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given label</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationship(rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for its type</p></td>
</tr>
</tbody>
</table>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/{img}/apoc.index.nodes-with-score.jpg" alt="apoc.index.nodes with score" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.search('index-name', 'query') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">search for the first 100 nodes in the given full text index matching the given lucene query returned by relevance</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.nodes('Label','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on node index with the given label name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.relationships('TYPE','prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.between(node1,'TYPE',node2,'prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name bound by either or both sides (each node parameter can be null)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.out(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>outgoing</strong> relationship of the given node, <strong>returns end-nodes</strong></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.in(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>incoming</strong> relationship of the given node, <strong>returns start-nodes</strong></p></td>
</tr>
</tbody>
</table>



   <h4>Index Management</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.list() YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lists all manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.remove('name') YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">removes manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forNodes('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual node index</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forRelationships('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual relationship index</p></td>
</tr>
</tbody>
</table>
<div class="listingblock">
<div class="title">Add node to index example</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->match (p:Person) call apoc.index.addNode(p,["name","age"]) RETURN count(*);
// 129s for 1M People
call apoc.index.nodes('Person','name:name100*') YIELD node, weight return * limit 2<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



   <h4>Manual Indexes</h4>
   


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Data Used</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>The below examples use <a href="https://github.com/nicolewhite/neo4j-flights">flight data</a>.</p>
</div>
<div class="paragraph">
<p>Here is a sample subset of the data that can be load to try the procedures:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CREATE (slc:Airport {abbr:'SLC', id:14869, name:'SALT LAKE CITY INTERNATIONAL'})
CREATE (oak:Airport {abbr:'OAK', id:13796, name:'METROPOLITAN OAKLAND INTERNATIONAL'})
CREATE (bur:Airport {abbr:'BUR', id:10800, name:'BOB HOPE'})
CREATE (f2:Flight {flight_num:6147, day:2, month:1, weekday:6, year:2016})
CREATE (f9:Flight {flight_num:6147, day:9, month:1, weekday:6, year:2016})
CREATE (f16:Flight {flight_num:6147, day:16, month:1, weekday:6, year:2016})
CREATE (f23:Flight {flight_num:6147, day:23, month:1, weekday:6, year:2016})
CREATE (f30:Flight {flight_num:6147, day:30, month:1, weekday:6, year:2016})
CREATE (f2)-[:DESTINATION {arr_delay:-13, taxi_time:9}]-&gt;(oak)
CREATE (f9)-[:DESTINATION {arr_delay:-8, taxi_time:4}]-&gt;(bur)
CREATE (f16)-[:DESTINATION {arr_delay:-30, taxi_time:4}]-&gt;(slc)
CREATE (f23)-[:DESTINATION {arr_delay:-21, taxi_time:3}]-&gt;(slc)
CREATE (f30)-[:DESTINATION]-&gt;(slc)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Using Manual Index on Node Properties</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>In order to create manual index on a node property, you call <code>apoc.index.addNode</code> with the node, providing the properties to be indexed.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (a:Airport)
CALL apoc.index.addNode(a,['name'])
RETURN count(*)<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>The statement will create the node index with the <strong>same name as the Label name(s) of the node</strong> in this case <code>Airport</code> and add the node by their properties to the index.</p>
</div>
<div class="paragraph">
<p>Once this has been added check if the node index exists using <code>apoc.index.list</code>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.list()<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Usually <code>apoc.index.addNode</code> would be used as part of node-creation, e.g. during LOAD CSV.
There is also <code>apoc.index.addNodes</code> for adding a list of multiple nodes at once.</p>
</div>
<div class="paragraph">
<p>Once the node index is created we can start using it.</p>
</div>
<div class="paragraph">
<p>Here are some examples:</p>
</div>
<div class="paragraph">
<p>The <code>apoc.index.nodes</code> finds nodes in a manual index using the given lucene query.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
That makes only sense if you combine multiple properties in one lookup or use case insensitive or fuzzy matching full-text queries.
In all other cases the built in schema indexes should be used.
</td>
</tr>
</table>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.nodes('Airport','name:inter*') YIELD node AS airport, weight
RETURN airport.name, weight
LIMIT 10<!--/code--></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
Apoc index queries not only return nodes and relationships but also a weight, which is the score returned from the underlying Lucene index.
The results are also sorted by that score.
That&#8217;s especially helpful for partial and fuzzy text searches.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To remove the node index <code>Airport</code> created, use:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.remove('Airport')<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Using Manual Index on Relationship Properties</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>The procedure <code>apoc.index.addRelationship</code> is used to create a manual index on relationship properties.</p>
</div>
<div class="paragraph">
<p>As there are no schema indexes for relationships, these manual indexes can be quite useful.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (:Flight)-[r:DESTINATION]-&gt;(:Airport)
CALL apoc.index.addRelationship(r,['taxi_time'])
RETURN count(*)<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>The statement will create the relationship index with the <strong>same name as relationship-type</strong>, in this case <code>DESTINATION</code> and add the relationship by its properties to the index.</p>
</div>
<div class="paragraph">
<p>Using <code>apoc.index.relationships</code>, we can find the relationship of type <code>DESTINATION</code> with the property <code>taxi_time</code> of 11 minutes.
We can chose to also return the start and end-node.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.relationships('DESTINATION','taxi_time:11') YIELD rel, start AS flight, end AS airport
RETURN flight_num.flight_num, airport.name;<!--/code--></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
Manual relationship indexed do not only store the relationship by its properties but also the start- and end-node.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>That&#8217;s why we can use that information to subselect relationships not only by property but also by those nodes, which is quite powerful.</p>
</div>
<div class="paragraph">
<p>With <code>apoc.index.in</code> we can pin the node with incoming relationships (end-node) to get the start nodes for all the <code>DESTINATION</code> relationships.
For instance to find all flights arriving in 'SALT LAKE CITY INTERNATIONAL' with a taxi_time of 7 minutes we&#8217;d use:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (a:Airport {name:'SALT LAKE CITY INTERNATIONAL'})
CALL apoc.index.in(a,'DESTINATION','taxi_time:7') YIELD node AS flight
RETURN flight<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>The opposite is <code>apoc.index.out</code>, which takes and binds end-nodes and returns start-nodes of relationships.</p>
</div>
<div class="paragraph">
<p>Really useful to quickly find a subset of relationships between nodes with many relationships (tens of thousands to millions) is <code>apoc.index.between</code>.
Here you bind both the start and end-node and provide (or not) properties of the relationships.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (f:Flight {flight_num:6147})
MATCH (a:Airport {name:'SALT LAKE CITY INTERNATIONAL'})
CALL apoc.index.between(f,'DESTINATION',a,'taxi_time:7') YIELD rel, weight
RETURN *<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>To remove the relationship index <code>DESTINATION</code> that was created, use.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.remove('DESTINATION')<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



   <h4>Full Text Search</h4>
   <div class="paragraph">
<p>Indexes are used for finding nodes in the graph that further operations can then continue from.
Just like in a book where you look at the index to find a section that interest you, and then start reading from there.
A full text index allows you to find occurrences of individual words or phrases across all attributes.</p>
</div>
<div class="paragraph">
<p>In order to use the full text search feature, we have to first index our data by specifying all the attributes we want to index.
Here we create a full text index called <code>locations</code> (we will use this name when searching in the index) with our data.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.addAllNodes('locations',{
  Company: ["name", "description"],
  Person:  ["name","address"],
  Address: ["address"]})<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Creating the index will take a little while since the procedure has to read through the entire database to create the index.</p>
</div>
<div class="paragraph">
<p>We can now use this index to search for nodes in the database.
The most simple case would be to search across all data for a particular word.</p>
</div>
<div class="paragraph">
<p>It does not matter which property that word exists in, any node that has that word in any of its indexed properties will be found.</p>
</div>
<div class="paragraph">
<p>If you enter a name into the form, all occurrences will be found (but limited to 100 results).</p>
</div>
<form><div class="node"><div class="form-group">
<label>Word to search for:</label> <input value-for="search" class="form-control">
</div></div></form>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", '<span  value-key="search"></span>')<!--/code--></pre>
</div>
</div>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Advanced Search</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We can further restrict our search to only searching in a particular attribute.
In order to search for a <code>Person</code> with an address in <strong>France</strong>, we use the following.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", "Person.address:France")<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Test it yourself:</p>
</div>
<form><div class="node"><div class="form-group">
<label>Label/Type to search for:</label> <input value-for="label" class="form-control">
<label>Attribute to search for:</label> <input value-for="property" class="form-control">
<label>Word to search for:</label> <input value-for="search" class="form-control">
</div></div></form>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", "<span  value-key="label"></span>.<span  value-key="property"></span>:<span value-key="search"></span>")<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Now we can search for nodes with a specific property value, and then explore their neighbourhoods visually.</p>
</div>
<div class="paragraph">
<p>But integrating it with an graph query is so much more powerful.</p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Fulltext and Graph Search</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We could for instance search for addresses in the database that contain the word "Paris", and then find all companies registered at those addresses:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", "Address.address:Paris~") YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
RETURN company LIMIT 50<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>The tilde (~) instructs the index search procedure to do a fuzzy match, allowing us to find Paris even if the spelling is slightly off.</p>
</div>
<div class="paragraph">
<p>We might notice that there are addresses that contain the word Paris that are not in Paris, France.
For example there might be a Paris Street somewhere.</p>
</div>
<div class="paragraph">
<p>We can further specify that we want the text to contain both the word Paris, and the word France:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", "+Address.address:Paris~ +France~")
YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
RETURN company LIMIT 50<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Complex Searches</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Things start to get interesting when we look at how the different entities in Paris are connected to one another.
We can do that by finding all the entities with addresses in Paris, then creating all pairs of such entities and finding the shortest path between each such pair:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.index.search("locations", "+Address.address:Paris~ +France~") YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
WITH collect(company) AS companies

// create unique pairs
UNWIND companies AS x UNWIND companies AS y
WITH x, y WHERE ID(x) &lt; ID(y)

MATCH path = shortestPath((x)-[*..10]-(y))
RETURN path<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>For more details on the query syntax used in the second parameter of the <code>search</code> procedure,
please see <a href="http://www.lucenetutorial.com/lucene-query-syntax.html">this Lucene query tutorial</a></p>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Utility Functions</h3>
    <br/>
    <div>
      
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>TimeToLive (TTL) - Expire Nodes</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Enable cleanup of expired nodes in <code>neo4j.conf</code> with <code>apoc.ttl.enabled=true</code></p>
</div>
<div class="paragraph">
<p>30s after startup an index is created:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CREATE INDEX FOR (n:TTL) ON (n.ttl)<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>At startup a statement is scheduled to run every 60s (or configure in <code>neo4j.conf</code> -  <code>apoc.ttl.schedule=120</code>)</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (t:TTL) where t.ttl &gt; timestamp() WITH t LIMIT 1000 DETACH DELETE t<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>ttl</code> property holds the <strong>time when the node is expired in milliseconds since epoch</strong>.</p>
</div>
<div class="paragraph">
<p>You can expire your nodes by setting the :TTL label and the ttl property:</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (n:Foo) WHERE n.bar SET n:TTL, n.ttl = timestamp() + 10000;<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Graph Algorithms</h3>
    <br/>
    <div>
      
	</div>
  </div>
</slide>


   <h4>Centrality Algorithms</h4>
   


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Setup</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Let&#8217;s create some test data to run the Centrality algorithms on.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// create 100 nodes
FOREACH (id IN range(0,1000) | CREATE (:Node {id:id}))

// over the cross product (1M) create 100.000 relationships
MATCH (n1:Node),(n2:Node) WITH n1,n2 LIMIT 1000000 WHERE rand() &lt; 0.1

CREATE (n1)-[:TYPE]-&gt;(n2)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



   <h4>PageRank Algorithm</h4>
   


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Setup</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Let&#8217;s create some test data to run the PageRank algorithm on.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->// create 100 nodes
FOREACH (id IN range(0,1000) | CREATE (:Node {id:id}))

// over the cross product (1M) create 100.000 relationships
MATCH (n1:Node),(n2:Node) WITH n1,n2 LIMIT 1000000 WHERE rand() &lt; 0.1

CREATE (n1)-[:TYPE_1]-&gt;(n2)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Graph Refactoring</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>In order not to have to repeatedly geocode the same thing in multiple queries, especially
if the database will be used by many people, it might be a good idea to persist the results
in the database so that subsequent calls can use the saved results.</p>
</div>
<div class="paragraph">
<p>Geocode and persist the result</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (a:Place)
WHERE a.address IS NOT NULL AND a.latitude IS NULL
WITH a LIMIT 1000
CALL apoc.spatial.geocodeOnce(a.address) YIELD location
SET a.latitude = location.latitude
SET a.longitude = location.longitude<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>Note that the above command only geocodes the first 1000 Place nodes that have not already been geocoded.
This query can be run multiple times until all places are geocoded. Why would we want to do this?
Two good reasons:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>The geocoding service is a public service that can throttle or blacklist sites that hit the service too heavily, so controlling how much we do is useful.</p>
</li>
<li>
<p>The transaction is updating the database, and it is wise not to update the database with too many things in the same transaction, to avoid using up too much memory. This trick will keep the memory usage very low.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Now make use of the results in distance queries</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->WITH point({latitude: 48.8582532, longitude: 2.294287}) AS eiffel
MATCH (a:Place)
WHERE a.latitude IS NOT NULL AND a.longitude IS NOT NULL
WITH a, point.distance(point(a), eiffel) AS distance
WHERE distance &lt; 5000
RETURN a.name, distance
ORDER BY distance
LIMIT 100<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Data Integration</h3>
    <br/>
    <div>
      
	</div>
  </div>
</slide>

   <h4>Load JDBC</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','SELECT * FROM PERSON WHERE AGE &gt; 18')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.driver('org.apache.derby.jdbc.EmbeddedDriver')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">register JDBC driver of source database</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>To simplify the JDBC URL syntax, for example 'jdbc:derby:derbyDB', and so as to mask the details one can define in conf/neo4j.conf</p>
</div>
<div class="listingblock">
<div class="content">
<pre>apoc.jdbc.derby.url=jdbc:derby:derbyDB</pre>
</div>
</div>
<div class="paragraph">
<p>and then</p>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</pre>
</div>
</div>
<div class="paragraph">
<p>becomes</p>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('derby','PERSON') YIELD row CREATE (:Person {name:row.name})</pre>
</div>
</div>
<div class="paragraph">
<p>The 3rd value in the 'apoc.jdbc.derby.url=' effectively defines an &lt;alias&gt; to be used in the apoc.load.jdbc('&lt;alias&gt;',&#8230;&#8203;.</p>
</div>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>MySQL Example</h3>
    <br/>
    <div>
      


   <h4>MySQL Northwind Data</h4>
   <div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="sql" lang="sql"><!--code class="sql language-sql"-->select count(*) from products;
+----------+
| count(*) |
+----------+
|       77 |
+----------+
1 row in set (0,00 sec)

describe products;
+-----------------+---------------+------+-----+---------+----------------+
| Field           | Type          | Null | Key | Default | Extra          |
+-----------------+---------------+------+-----+---------+----------------+
| ProductID       | int(11)       | NO   | PRI | NULL    | auto_increment |
| ProductName     | varchar(40)   | NO   | MUL | NULL    |                |
| SupplierID      | int(11)       | YES  | MUL | NULL    |                |
| CategoryID      | int(11)       | YES  | MUL | NULL    |                |
| QuantityPerUnit | varchar(20)   | YES  |     | NULL    |                |
| UnitPrice       | decimal(10,4) | YES  |     | 0.0000  |                |
| UnitsInStock    | smallint(2)   | YES  |     | 0       |                |
| UnitsOnOrder    | smallint(2)   | YES  |     | 0       |                |
| ReorderLevel    | smallint(2)   | YES  |     | 0       |                |
| Discontinued    | bit(1)        | NO   |     | b'0'    |                |
+-----------------+---------------+------+-----+---------+----------------+
10 rows in set (0,00 sec)<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Load JDBC Examples</h3>
    <br/>
    <div>
      <div class="listingblock">
<div class="title">Load the JDBC driver</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->cypher CALL apoc.load.driver("com.mysql.jdbc.Driver");<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Count rows in products table</div>
<div class="content">
<pre>with "jdbc:mysql://localhost:3306/northwind?user=root" as url
cypher CALL apoc.load.jdbc(url,"products") YIELD row
RETURN count(*);</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+----------+
| count(*) |
+----------+
| 77       |
+----------+
1 row
23 ms</pre>
</div>
</div>
<div class="listingblock">
<div class="title">Return row from products table</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->with "jdbc:mysql://localhost:3306/northwind?user=root" as url
cypher CALL apoc.load.jdbc(url,"products") YIELD row
RETURN row limit 1;<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------------------------------------------------------------------------------+
| row                                                                            |
+--------------------------------------------------------------------------------+
| {UnitPrice -&gt; 18.0000, UnitsOnOrder -&gt; 0, CategoryID -&gt; 1, UnitsInStock -&gt; 39} |
+--------------------------------------------------------------------------------+
1 row
10 ms</pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/{img}/apoc-load-jdbc.jpg" alt="apoc load jdbc" width="800">
</div>
</div>
<div class="listingblock">
<div class="title">Create data from jdbc query results in batches (and in parallel).</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.periodic.iterate('
call apoc.load.jdbc("jdbc:mysql://localhost:3306/northwind?user=root","company")',
'CREATE (p:Person) SET p += value', {batchSize:10000, parallel:true})
RETURN batches, total<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Cassandra Example</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Setup Song database as initial dataset</p>
</div>
<div class="listingblock">
<div class="content">
<pre>curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/playlist.cql
curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/artists.csv
curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/songs.csv
$CASSANDRA_HOME/bin/cassandra
$CASSANDRA_HOME/bin/cqlsh -f playlist.cql</pre>
</div>
</div>
<div class="paragraph">
<p>Download the <a href="https://github.com/adejanovski/cassandra-jdbc-wrapper#installing">Cassandra JDBC Wrapper</a>, and put it into your <code>$NEO4J_HOME/plugins</code> directory.
Add this config option to <code>$NEO4J_HOME/conf/neo4j.conf</code> to make it easier to interact with the cassandra instance.</p>
</div>
<div class="listingblock">
<div class="title">Add to conf/neo4j.conf</div>
<div class="content">
<pre>apoc.jdbc.cassandra_songs.url=jdbc:cassandra://localhost:9042/playlist</pre>
</div>
</div>
<div class="paragraph">
<p>Restart the server.</p>
</div>
<div class="paragraph">
<p>Now you can inspect the data in Cassandra with.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN count(*);<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
count(*)

3605    
</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN row LIMIT 5;

CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN row.first_letter, row.artist LIMIT 5;<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
row.first_letterrow.artist                     

C               C.W. Stoneking                 

C               CH2K                           

C               CHARLIE HUNTER WITH LEON PARKER

C               Calvin Harris                  

C               Caman                         
</pre>
</div>
</div>
<div class="paragraph">
<p>Let&#8217;s create some graph data, we have a look at the track_by_artist table, which contains about 60k records.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row RETURN count(*);<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
RETURN row LIMIT 5;<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
RETURN row.track_id, row.track_length_in_seconds, row.track, row.music_file, row.genre, row.artist, row.starred LIMIT 2;<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
row.track_id                        lengthrow.track       row.music_file    row.genrerow.artist                  row.starred

c0693b1e-0eaa-4e81-b23f-b083db303842219   1913 Massacre   TRYKHMD128F934154Cfolk     Woody Guthrie &amp; Jack Elliottfalse      

7d114937-0bc7-41c7-8e0c-94b5654ac77f178   Alabammy Bound  TRMQLPV128F934152Bfolk     Woody Guthrie &amp; Jack Elliottfalse      
</pre>
</div>
</div>
<div class="paragraph">
<p>Let&#8217;s create some indexes and constraints, note that other indexes and constraints will be dropped by this.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.schema.assert(
  {Track:['title','length']},
  {Artist:['name'],Track:['id'],Genre:['name']});<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
label       key    uniqueaction 

Track       title  false CREATED

Track       length false CREATED

Artist      name   true  CREATED

Genre       name   true  CREATED

Track       id     true  CREATED
</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
MERGE (a:Artist {name:row.artist})
MERGE (g:Genre {name:row.genre})
CREATE (t:Track {id:toString(row.track_id), title:row.track, length:row.track_length_in_seconds})
CREATE (a)-[:PERFORMED]-&gt;(t)
CREATE (t)-[:GENRE]-&gt;(g);<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>Added 63213 labels, created 63213 nodes, set 182413 properties, created 119200 relationships, statement executed in 40076 ms.</pre>
</div>
</div>
	</div>
  </div>
</slide>



   <h4>Streaming Data to Gephi</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.gephi.add(url-or-key, workspace, data)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">streams provided data to Gephi</p></td>
</tr>
</tbody>
</table>



   <h4>Notes</h4>
   <div class="paragraph">
<p>Gephi has a <a href="https://marketplace.gephi.org/plugin/graph-streaming/">streaming plugin</a>, that can provide and accept <a href="https://github.com/gephi/gephi/wiki/GraphStreaming#Gephi_as_Master">JSON-graph-data</a> in a streaming fashion.</p>
</div>
<div class="paragraph">
<p>Make sure to install the plugin firsrt and activate it for your workspace (there is a new "Streaming"-tab besides "Layout"), right-click "Master"&#8594;"start" to start the server.</p>
</div>
<div class="paragraph">
<p>You can provide your workspace name (you might want to rename it before you start thes streaming), otherwise it defaults to <code>workspace0</code></p>
</div>
<div class="paragraph">
<p>The default Gephi-URL is <a href="http://localhost:8080" class="bare">http://localhost:8080</a>, resulting in <code><a href="http://localhost:8080/workspace0?operation=updateGraph" class="bare">http://localhost:8080/workspace0?operation=updateGraph</a></code></p>
</div>
<div class="paragraph">
<p>You can also configure it in <code>conf/neo4j.conf</code> via  <code>apoc.gephi.url=url</code> or <code>apoc.gephi.&lt;key&gt;.url=url</code></p>
</div>



   <h4>Example</h4>
   <div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->match path = (:Person)-[:ACTED_IN]-&gt;(:Movie)
WITH path LIMIT 1000
with collect(path) as paths
call apoc.gephi.add(null,'workspace0', paths) yield nodes, relationships, time
return nodes, relationships, time<!--/code--></pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="http://guides.neo4j.com/intro/{img}/apoc.gephi.gif" alt="apoc.gephi" width="800">
</div>
</div>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Format</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>We send all nodes and relationships of the passed in data convert into individual Gephi-Streaming JSON fragements, separated by <code>\r\n</code>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="javascript" lang="javascript"><!--code class="javascript language-javascript"-->{"an":{"123":{"TYPE":"Person:Actor","label":"Tom Hanks",                           x:333,y:222,r:0.1,g:0.3,b:0.5}}}\r\n
{"an":{"345":{"TYPE":"Movie","label":"Forrest Gump",                               x:234,y:122,r:0.2,g:0.2,b:0.7}}}\r\n
{"ae":{"3344":{"TYPE":"ACTED_IN","label":"Tom Hanks",source:"123",target:"345","directed":true,r:0.1,g:0.3,b:0.5}}}<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Specifics Details</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Gephi doesn&#8217;t render the graph data unless you also provide x,y coordinates in the payload, so we just send random ones within a 1000x1000 grid.</p>
</div>
<div class="paragraph">
<p>We also generate colors per label combination and relationship-type, both of which are also transferred as <code>TYPE</code> property.</p>
</div>
	</div>
  </div>
</slide>



   <h4>ElasticSearch Integration</h4>
   <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.stats(host-url-Key)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">elastic search statistics</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.get(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.query(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a SEARCH operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.getRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.postRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.post(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.put(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a PUT operation</p></td>
</tr>
</tbody>
</table>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Example</h3>
    <br/>
    <div>
      <div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.es.post("localhost","tweets","users","1",null,{name:"Chris"})<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.es.get("localhost","tweets","users","1",null,null)<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.es.stats("localhost")<!--/code--></pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="http://i.imgur.com/qHAj9ma.png" alt="qHAj9ma" width="500">
</div>
</div>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>General Structure and Parameters</h3>
    <br/>
    <div>
      <div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.es.post(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value

// GET/PUT/POST url/index/type/id?query -d payload<!--/code--></pre>
</div>
</div>



   <h4>host or port parameter</h4>
   <div class="paragraph">
<p>The parameter can be a direct host or url, or an entry to be lookup up in neo4j.conf</p>
</div>
<div class="ulist">
<ul>
<li>
<p>host</p>
</li>
<li>
<p>host:port</p>
</li>
<li>
<p><a href="http://host:port" class="bare">http://host:port</a></p>
</li>
<li>
<p>lookup via key to apoc.es.&lt;key&gt;.url</p>
</li>
<li>
<p>lookup via key apoc.es.&lt;key&gt;.host</p>
</li>
<li>
<p>lookup apoc.es.url</p>
</li>
<li>
<p>lookup apoc.es.host</p>
</li>
</ul>
</div>



   <h4>index parameter</h4>
   <div class="paragraph">
<p>Main ES index, will be sent directly, if null then "_all" multiple indexes can be separated by comma in the string.</p>
</div>



   <h4>type parameter</h4>
   <div class="paragraph">
<p>Document type, will be sent directly, if null then "_all" multiple types can be separated by comma in the string.</p>
</div>



   <h4>id parameter</h4>
   <div class="paragraph">
<p>Document id, will be left off when null.</p>
</div>



   <h4>query parameter</h4>
   <div class="paragraph">
<p>Query can be a map which is turned into a query string, a direct string or null then it is left off.</p>
</div>



   <h4>payload parameter</h4>
   <div class="paragraph">
<p>Payload can be a <strong>map</strong> which will be turned into a json payload or a string which will be sent directly or null.</p>
</div>



   <h4>Results</h4>
   <div class="paragraph">
<p>Results are stream of map in value.</p>
</div>
	</div>
  </div>
</slide>



   <h4>Load XML</h4>
   


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Example: How do you access xml doc attributes in children fields ?</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>(Thanks Nicolas Rouyer)</p>
</div>
<div class="paragraph">
<p>For example, if my XML file is the example <a href="https://msdn.microsoft.com/en-us/library/ms762271%28v=vs.85%29.aspx">book.xml provided by microsoft</a>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="xml" lang="xml"><!--code class="xml language-xml"-->&lt;?xml version="1.0"?&gt;
&lt;catalog&gt;
   &lt;book id="bk101"&gt;
      &lt;author&gt;Gambardella, Matthew&lt;/author&gt;
      &lt;title&gt;XML Developer's Guide&lt;/title&gt;
      &lt;genre&gt;Computer&lt;/genre&gt;
      &lt;price&gt;44.95&lt;/price&gt;
      &lt;publish_date&gt;2000-10-01&lt;/publish_date&gt;
      &lt;description&gt;An in-depth look at creating applications
      with XML.&lt;/description&gt;
   &lt;/book&gt;
   &lt;book id="bk102"&gt;
      &lt;author&gt;Ralls, Kim&lt;/author&gt;
      &lt;title&gt;Midnight Rain&lt;/title&gt;
      &lt;genre&gt;Fantasy&lt;/genre&gt;
      &lt;price&gt;5.95&lt;/price&gt;
      &lt;publish_date&gt;2000-12-16&lt;/publish_date&gt;
      &lt;description&gt;A former architect battles corporate zombies,
...<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>We have the file here: <a href="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml" class="bare">https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml</a></p>
</div>
<div class="paragraph">
<p>Let&#8217;s just load it and see what it looks like, it&#8217;s returned as value map with nested <code>_type</code> and <code>_children</code> fields, per group of elements.
Attributes are turned into map-entries.
And elements into their own little map with <code>_type</code>, attributes and <code>_children</code> if applicable.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml")<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="javascript" lang="javascript"><!--code class="javascript language-javascript"-->{_type: catalog, _children: [
  {_type: book, id: bk101, _children: [
    {_type: author, _text: Gambardella, Matthew},
    {_type: title, _text: XML Developer's Guide},
    {_type: genre, _text: Computer},
    {_type: price, _text: 44.95},
    {_type: publish_date, _text: 2000-10-01},
    {_type: description, _text: An in-depth look at creating applications ....<!--/code--></pre>
</div>
</div>



   <h4>For each book, how do I access book id ?</h4>
   <div class="paragraph">
<p>You can access attributes per element directly.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
RETURN book.id<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
book.id

bk101  

bk102  </pre>
</div>
</div>



   <h4>For each book, how do I access book author and title ?</h4>
   


   <h4>Filter into collection</h4>
   <div class="paragraph">
<p>You have to filter over the sub-elements  in the <code>_childrens</code> array in this case.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
RETURN book.id, [attr IN book._children WHERE attr._type IN ['author','title'] | [attr._type, attr._text]] as pairs<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
book.idpairs                                                                   

bk101  [[author, Gambardella, Matthew], [title, XML Developer's Guide]]        

bk102  [[author, Ralls, Kim], [title, Midnight Rain]]                          </pre>
</div>
</div>



   <h4>Return Collection Elements</h4>
   <div class="paragraph">
<p>This is not too nice, we could also just have returned the values and then grabbed them out of the list, but that relies on element-order.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
WITH book.id as id, [attr IN book._children WHERE attr._type IN ['author','title'] | attr._text] as pairs
RETURN id, pairs[0] as author, pairs[1] as title<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
id   author              title                         

bk101Gambardella, MatthewXML Developer's Guide         

bk102Ralls, Kim          Midnight Rain                 </pre>
</div>
</div>


	</div>
  </div>
</slide>


<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Cypher Operations</h3>
    <br/>
    <div>
      
	</div>
  </div>
</slide>



   <h4>Running Cypher fragments</h4>
   <div class="paragraph">
<p>We can use Cypher as safe, graph-aware, partially compiled scripting language within APOC.</p>
</div>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Cypher Execution</h3>
    <br/>
    <div>
      <table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16.6666%;">
<col style="width: 83.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.runFile(file or url) yield row, result</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">runs each statement in the file, all semicolon separated - currently no schema operations</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.mapParallel(fragment, params, list-to-parallelize) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">executes fragment in parallel batches with the list segments being assigned to _</p></td>
</tr>
</tbody>
</table>
	</div>
  </div>
</slide>



<slide class="row-fluid">
  <div class="col-sm-12">
    <h3>Example: Fast Node-Counts by Label</h3>
    <br/>
    <div>
      <div class="paragraph">
<p>Counts by label are quickly provided by the counts-store, but only if they are the only thing in the query, like</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (:Person) RETURN count(*);<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>It also works to combine several with <code>UNION ALL</code>, but not via <code>WITH</code></p>
</div>
<div class="listingblock">
<div class="title">Doesn&#8217;t work</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (:Person) WITH count(*) as people
MATCH (:Movie) RETURN people, count(*) as movies;<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Works</div>
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->MATCH (:Person) RETURN count(*)
UNION ALL
MATCH (:Movie) RETURN count(*);<!--/code--></pre>
</div>
</div>
<div class="paragraph">
<p>But with <code>apoc.cypher.run</code> we can construct the statement and run each of them individually, so it completes in a few ms.</p>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call db.labels() yield label
call apoc.cypher.run("match (:`"+label+"`) return count(*) as count", null) yield value
return label, value.count as count<!--/code--></pre>
</div>
</div>
	</div>
  </div>
</slide>


   <h4>Job management and periodic execution</h4>
   <div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
this document is work in progress
</td>
</tr>
</table>
</div>
<div class="listingblock">
<div class="content">
<pre mode="cypher"  class="highlight pre-scrollable programlisting cm-s-neo code runnable standalone-example ng-binding" data-lang="cypher" lang="cypher"><!--code class="cypher language-cypher"-->call apoc.periodic.commit("
match (u:User)
where not u:Processed
with u limit {limit}
SET u:Processed RETURN count(*)
",{limit:10000})<!--/code--></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+=======+==========+
|updates|executions|
+=======+==========+
|2000000|200       |
+-------+----------+</pre>
</div>
</div>
  </carousel>
</article>
