<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<!--[if IE]><meta http-equiv="X-UA-Compatible" content="IE=edge"><![endif]-->
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="generator" content="Asciidoctor 1.5.3">
<title>APOC User Guide 3.1.2.5</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans:300,300italic,400,400italic,600,600italic%7CNoto+Serif:400,400italic,700,700italic%7CDroid+Sans+Mono:400,700">
<style>
/* Asciidoctor default stylesheet | MIT License | http://asciidoctor.org */
/* Remove comment around @import statement below when using as a custom stylesheet */
/*@import "https://fonts.googleapis.com/css?family=Open+Sans:300,300italic,400,400italic,600,600italic%7CNoto+Serif:400,400italic,700,700italic%7CDroid+Sans+Mono:400,700";*/
article,aside,details,figcaption,figure,footer,header,hgroup,main,nav,section,summary{display:block}
audio,canvas,video{display:inline-block}
audio:not([controls]){display:none;height:0}
[hidden],template{display:none}
script{display:none!important}
html{font-family:sans-serif;-ms-text-size-adjust:100%;-webkit-text-size-adjust:100%}
body{margin:0}
a{background:transparent}
a:focus{outline:thin dotted}
a:active,a:hover{outline:0}
h1{font-size:2em;margin:.67em 0}
abbr[title]{border-bottom:1px dotted}
b,strong{font-weight:bold}
dfn{font-style:italic}
hr{-moz-box-sizing:content-box;box-sizing:content-box;height:0}
mark{background:#ff0;color:#000}
code,kbd,pre,samp{font-family:monospace;font-size:1em}
pre{white-space:pre-wrap}
q{quotes:"\201C" "\201D" "\2018" "\2019"}
small{font-size:80%}
sub,sup{font-size:75%;line-height:0;position:relative;vertical-align:baseline}
sup{top:-.5em}
sub{bottom:-.25em}
img{border:0}
svg:not(:root){overflow:hidden}
figure{margin:0}
fieldset{border:1px solid silver;margin:0 2px;padding:.35em .625em .75em}
legend{border:0;padding:0}
button,input,select,textarea{font-family:inherit;font-size:100%;margin:0}
button,input{line-height:normal}
button,select{text-transform:none}
button,html input[type="button"],input[type="reset"],input[type="submit"]{-webkit-appearance:button;cursor:pointer}
button[disabled],html input[disabled]{cursor:default}
input[type="checkbox"],input[type="radio"]{box-sizing:border-box;padding:0}
input[type="search"]{-webkit-appearance:textfield;-moz-box-sizing:content-box;-webkit-box-sizing:content-box;box-sizing:content-box}
input[type="search"]::-webkit-search-cancel-button,input[type="search"]::-webkit-search-decoration{-webkit-appearance:none}
button::-moz-focus-inner,input::-moz-focus-inner{border:0;padding:0}
textarea{overflow:auto;vertical-align:top}
table{border-collapse:collapse;border-spacing:0}
*,*:before,*:after{-moz-box-sizing:border-box;-webkit-box-sizing:border-box;box-sizing:border-box}
html,body{font-size:100%}
body{background:#fff;color:rgba(0,0,0,.8);padding:0;margin:0;font-family:"Noto Serif","DejaVu Serif",serif;font-weight:400;font-style:normal;line-height:1;position:relative;cursor:auto}
a:hover{cursor:pointer}
img,object,embed{max-width:100%;height:auto}
object,embed{height:100%}
img{-ms-interpolation-mode:bicubic}
.left{float:left!important}
.right{float:right!important}
.text-left{text-align:left!important}
.text-right{text-align:right!important}
.text-center{text-align:center!important}
.text-justify{text-align:justify!important}
.hide{display:none}
body{-webkit-font-smoothing:antialiased}
img,object,svg{display:inline-block;vertical-align:middle}
textarea{height:auto;min-height:50px}
select{width:100%}
.center{margin-left:auto;margin-right:auto}
.spread{width:100%}
p.lead,.paragraph.lead>p,#preamble>.sectionbody>.paragraph:first-of-type p{font-size:1.21875em;line-height:1.6}
.subheader,.admonitionblock td.content>.title,.audioblock>.title,.exampleblock>.title,.imageblock>.title,.listingblock>.title,.literalblock>.title,.stemblock>.title,.openblock>.title,.paragraph>.title,.quoteblock>.title,table.tableblock>.title,.verseblock>.title,.videoblock>.title,.dlist>.title,.olist>.title,.ulist>.title,.qlist>.title,.hdlist>.title{line-height:1.45;color:#7a2518;font-weight:400;margin-top:0;margin-bottom:.25em}
div,dl,dt,dd,ul,ol,li,h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6,pre,form,p,blockquote,th,td{margin:0;padding:0;direction:ltr}
a{color:#2156a5;text-decoration:underline;line-height:inherit}
a:hover,a:focus{color:#1d4b8f}
a img{border:none}
p{font-family:inherit;font-weight:400;font-size:1em;line-height:1.6;margin-bottom:1.25em;text-rendering:optimizeLegibility}
p aside{font-size:.875em;line-height:1.35;font-style:italic}
h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{font-family:"Open Sans","DejaVu Sans",sans-serif;font-weight:300;font-style:normal;color:#ba3925;text-rendering:optimizeLegibility;margin-top:1em;margin-bottom:.5em;line-height:1.0125em}
h1 small,h2 small,h3 small,#toctitle small,.sidebarblock>.content>.title small,h4 small,h5 small,h6 small{font-size:60%;color:#e99b8f;line-height:0}
h1{font-size:2.125em}
h2{font-size:1.6875em}
h3,#toctitle,.sidebarblock>.content>.title{font-size:1.375em}
h4,h5{font-size:1.125em}
h6{font-size:1em}
hr{border:solid #ddddd8;border-width:1px 0 0;clear:both;margin:1.25em 0 1.1875em;height:0}
em,i{font-style:italic;line-height:inherit}
strong,b{font-weight:bold;line-height:inherit}
small{font-size:60%;line-height:inherit}
code{font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;font-weight:400;color:rgba(0,0,0,.9)}
ul,ol,dl{font-size:1em;line-height:1.6;margin-bottom:1.25em;list-style-position:outside;font-family:inherit}
ul,ol,ul.no-bullet,ol.no-bullet{margin-left:1.5em}
ul li ul,ul li ol{margin-left:1.25em;margin-bottom:0;font-size:1em}
ul.square li ul,ul.circle li ul,ul.disc li ul{list-style:inherit}
ul.square{list-style-type:square}
ul.circle{list-style-type:circle}
ul.disc{list-style-type:disc}
ul.no-bullet{list-style:none}
ol li ul,ol li ol{margin-left:1.25em;margin-bottom:0}
dl dt{margin-bottom:.3125em;font-weight:bold}
dl dd{margin-bottom:1.25em}
abbr,acronym{text-transform:uppercase;font-size:90%;color:rgba(0,0,0,.8);border-bottom:1px dotted #ddd;cursor:help}
abbr{text-transform:none}
blockquote{margin:0 0 1.25em;padding:.5625em 1.25em 0 1.1875em;border-left:1px solid #ddd}
blockquote cite{display:block;font-size:.9375em;color:rgba(0,0,0,.6)}
blockquote cite:before{content:"\2014 \0020"}
blockquote cite a,blockquote cite a:visited{color:rgba(0,0,0,.6)}
blockquote,blockquote p{line-height:1.6;color:rgba(0,0,0,.85)}
@media only screen and (min-width:768px){h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{line-height:1.2}
h1{font-size:2.75em}
h2{font-size:2.3125em}
h3,#toctitle,.sidebarblock>.content>.title{font-size:1.6875em}
h4{font-size:1.4375em}}
table{background:#fff;margin-bottom:1.25em;border:solid 1px #dedede}
table thead,table tfoot{background:#f7f8f7;font-weight:bold}
table thead tr th,table thead tr td,table tfoot tr th,table tfoot tr td{padding:.5em .625em .625em;font-size:inherit;color:rgba(0,0,0,.8);text-align:left}
table tr th,table tr td{padding:.5625em .625em;font-size:inherit;color:rgba(0,0,0,.8)}
table tr.even,table tr.alt,table tr:nth-of-type(even){background:#f8f8f7}
table thead tr th,table tfoot tr th,table tbody tr td,table tr td,table tfoot tr td{display:table-cell;line-height:1.6}
body{tab-size:4}
h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{line-height:1.2;word-spacing:-.05em}
h1 strong,h2 strong,h3 strong,#toctitle strong,.sidebarblock>.content>.title strong,h4 strong,h5 strong,h6 strong{font-weight:400}
.clearfix:before,.clearfix:after,.float-group:before,.float-group:after{content:" ";display:table}
.clearfix:after,.float-group:after{clear:both}
*:not(pre)>code{font-size:.9375em;font-style:normal!important;letter-spacing:0;padding:.1em .5ex;word-spacing:-.15em;background-color:#f7f7f8;-webkit-border-radius:4px;border-radius:4px;line-height:1.45;text-rendering:optimizeSpeed}
pre,pre>code{line-height:1.45;color:rgba(0,0,0,.9);font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;font-weight:400;text-rendering:optimizeSpeed}
.keyseq{color:rgba(51,51,51,.8)}
kbd{font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;display:inline-block;color:rgba(0,0,0,.8);font-size:.65em;line-height:1.45;background-color:#f7f7f7;border:1px solid #ccc;-webkit-border-radius:3px;border-radius:3px;-webkit-box-shadow:0 1px 0 rgba(0,0,0,.2),0 0 0 .1em white inset;box-shadow:0 1px 0 rgba(0,0,0,.2),0 0 0 .1em #fff inset;margin:0 .15em;padding:.2em .5em;vertical-align:middle;position:relative;top:-.1em;white-space:nowrap}
.keyseq kbd:first-child{margin-left:0}
.keyseq kbd:last-child{margin-right:0}
.menuseq,.menu{color:rgba(0,0,0,.8)}
b.button:before,b.button:after{position:relative;top:-1px;font-weight:400}
b.button:before{content:"[";padding:0 3px 0 2px}
b.button:after{content:"]";padding:0 2px 0 3px}
p a>code:hover{color:rgba(0,0,0,.9)}
#header,#content,#footnotes,#footer{width:100%;margin-left:auto;margin-right:auto;margin-top:0;margin-bottom:0;max-width:62.5em;*zoom:1;position:relative;padding-left:.9375em;padding-right:.9375em}
#header:before,#header:after,#content:before,#content:after,#footnotes:before,#footnotes:after,#footer:before,#footer:after{content:" ";display:table}
#header:after,#content:after,#footnotes:after,#footer:after{clear:both}
#content{margin-top:1.25em}
#content:before{content:none}
#header>h1:first-child{color:rgba(0,0,0,.85);margin-top:2.25rem;margin-bottom:0}
#header>h1:first-child+#toc{margin-top:8px;border-top:1px solid #ddddd8}
#header>h1:only-child,body.toc2 #header>h1:nth-last-child(2){border-bottom:1px solid #ddddd8;padding-bottom:8px}
#header .details{border-bottom:1px solid #ddddd8;line-height:1.45;padding-top:.25em;padding-bottom:.25em;padding-left:.25em;color:rgba(0,0,0,.6);display:-ms-flexbox;display:-webkit-flex;display:flex;-ms-flex-flow:row wrap;-webkit-flex-flow:row wrap;flex-flow:row wrap}
#header .details span:first-child{margin-left:-.125em}
#header .details span.email a{color:rgba(0,0,0,.85)}
#header .details br{display:none}
#header .details br+span:before{content:"\00a0\2013\00a0"}
#header .details br+span.author:before{content:"\00a0\22c5\00a0";color:rgba(0,0,0,.85)}
#header .details br+span#revremark:before{content:"\00a0|\00a0"}
#header #revnumber{text-transform:capitalize}
#header #revnumber:after{content:"\00a0"}
#content>h1:first-child:not([class]){color:rgba(0,0,0,.85);border-bottom:1px solid #ddddd8;padding-bottom:8px;margin-top:0;padding-top:1rem;margin-bottom:1.25rem}
#toc{border-bottom:1px solid #efefed;padding-bottom:.5em}
#toc>ul{margin-left:.125em}
#toc ul.sectlevel0>li>a{font-style:italic}
#toc ul.sectlevel0 ul.sectlevel1{margin:.5em 0}
#toc ul{font-family:"Open Sans","DejaVu Sans",sans-serif;list-style-type:none}
#toc li{line-height:1.3334;margin-top:.3334em}
#toc a{text-decoration:none}
#toc a:active{text-decoration:underline}
#toctitle{color:#7a2518;font-size:1.2em}
@media only screen and (min-width:768px){#toctitle{font-size:1.375em}
body.toc2{padding-left:15em;padding-right:0}
#toc.toc2{margin-top:0!important;background-color:#f8f8f7;position:fixed;width:15em;left:0;top:0;border-right:1px solid #efefed;border-top-width:0!important;border-bottom-width:0!important;z-index:1000;padding:1.25em 1em;height:100%;overflow:auto}
#toc.toc2 #toctitle{margin-top:0;margin-bottom:.8rem;font-size:1.2em}
#toc.toc2>ul{font-size:.9em;margin-bottom:0}
#toc.toc2 ul ul{margin-left:0;padding-left:1em}
#toc.toc2 ul.sectlevel0 ul.sectlevel1{padding-left:0;margin-top:.5em;margin-bottom:.5em}
body.toc2.toc-right{padding-left:0;padding-right:15em}
body.toc2.toc-right #toc.toc2{border-right-width:0;border-left:1px solid #efefed;left:auto;right:0}}
@media only screen and (min-width:1280px){body.toc2{padding-left:20em;padding-right:0}
#toc.toc2{width:20em}
#toc.toc2 #toctitle{font-size:1.375em}
#toc.toc2>ul{font-size:.95em}
#toc.toc2 ul ul{padding-left:1.25em}
body.toc2.toc-right{padding-left:0;padding-right:20em}}
#content #toc{border-style:solid;border-width:1px;border-color:#e0e0dc;margin-bottom:1.25em;padding:1.25em;background:#f8f8f7;-webkit-border-radius:4px;border-radius:4px}
#content #toc>:first-child{margin-top:0}
#content #toc>:last-child{margin-bottom:0}
#footer{max-width:100%;background-color:rgba(0,0,0,.8);padding:1.25em}
#footer-text{color:rgba(255,255,255,.8);line-height:1.44}
.sect1{padding-bottom:.625em}
@media only screen and (min-width:768px){.sect1{padding-bottom:1.25em}}
.sect1+.sect1{border-top:1px solid #efefed}
#content h1>a.anchor,h2>a.anchor,h3>a.anchor,#toctitle>a.anchor,.sidebarblock>.content>.title>a.anchor,h4>a.anchor,h5>a.anchor,h6>a.anchor{position:absolute;z-index:1001;width:1.5ex;margin-left:-1.5ex;display:block;text-decoration:none!important;visibility:hidden;text-align:center;font-weight:400}
#content h1>a.anchor:before,h2>a.anchor:before,h3>a.anchor:before,#toctitle>a.anchor:before,.sidebarblock>.content>.title>a.anchor:before,h4>a.anchor:before,h5>a.anchor:before,h6>a.anchor:before{content:"\00A7";font-size:.85em;display:block;padding-top:.1em}
#content h1:hover>a.anchor,#content h1>a.anchor:hover,h2:hover>a.anchor,h2>a.anchor:hover,h3:hover>a.anchor,#toctitle:hover>a.anchor,.sidebarblock>.content>.title:hover>a.anchor,h3>a.anchor:hover,#toctitle>a.anchor:hover,.sidebarblock>.content>.title>a.anchor:hover,h4:hover>a.anchor,h4>a.anchor:hover,h5:hover>a.anchor,h5>a.anchor:hover,h6:hover>a.anchor,h6>a.anchor:hover{visibility:visible}
#content h1>a.link,h2>a.link,h3>a.link,#toctitle>a.link,.sidebarblock>.content>.title>a.link,h4>a.link,h5>a.link,h6>a.link{color:#ba3925;text-decoration:none}
#content h1>a.link:hover,h2>a.link:hover,h3>a.link:hover,#toctitle>a.link:hover,.sidebarblock>.content>.title>a.link:hover,h4>a.link:hover,h5>a.link:hover,h6>a.link:hover{color:#a53221}
.audioblock,.imageblock,.literalblock,.listingblock,.stemblock,.videoblock{margin-bottom:1.25em}
.admonitionblock td.content>.title,.audioblock>.title,.exampleblock>.title,.imageblock>.title,.listingblock>.title,.literalblock>.title,.stemblock>.title,.openblock>.title,.paragraph>.title,.quoteblock>.title,table.tableblock>.title,.verseblock>.title,.videoblock>.title,.dlist>.title,.olist>.title,.ulist>.title,.qlist>.title,.hdlist>.title{text-rendering:optimizeLegibility;text-align:left;font-family:"Noto Serif","DejaVu Serif",serif;font-size:1rem;font-style:italic}
table.tableblock>caption.title{white-space:nowrap;overflow:visible;max-width:0}
.paragraph.lead>p,#preamble>.sectionbody>.paragraph:first-of-type p{color:rgba(0,0,0,.85)}
table.tableblock #preamble>.sectionbody>.paragraph:first-of-type p{font-size:inherit}
.admonitionblock>table{border-collapse:separate;border:0;background:none;width:100%}
.admonitionblock>table td.icon{text-align:center;width:80px}
.admonitionblock>table td.icon img{max-width:none}
.admonitionblock>table td.icon .title{font-weight:bold;font-family:"Open Sans","DejaVu Sans",sans-serif;text-transform:uppercase}
.admonitionblock>table td.content{padding-left:1.125em;padding-right:1.25em;border-left:1px solid #ddddd8;color:rgba(0,0,0,.6)}
.admonitionblock>table td.content>:last-child>:last-child{margin-bottom:0}
.exampleblock>.content{border-style:solid;border-width:1px;border-color:#e6e6e6;margin-bottom:1.25em;padding:1.25em;background:#fff;-webkit-border-radius:4px;border-radius:4px}
.exampleblock>.content>:first-child{margin-top:0}
.exampleblock>.content>:last-child{margin-bottom:0}
.sidebarblock{border-style:solid;border-width:1px;border-color:#e0e0dc;margin-bottom:1.25em;padding:1.25em;background:#f8f8f7;-webkit-border-radius:4px;border-radius:4px}
.sidebarblock>:first-child{margin-top:0}
.sidebarblock>:last-child{margin-bottom:0}
.sidebarblock>.content>.title{color:#7a2518;margin-top:0;text-align:center}
.exampleblock>.content>:last-child>:last-child,.exampleblock>.content .olist>ol>li:last-child>:last-child,.exampleblock>.content .ulist>ul>li:last-child>:last-child,.exampleblock>.content .qlist>ol>li:last-child>:last-child,.sidebarblock>.content>:last-child>:last-child,.sidebarblock>.content .olist>ol>li:last-child>:last-child,.sidebarblock>.content .ulist>ul>li:last-child>:last-child,.sidebarblock>.content .qlist>ol>li:last-child>:last-child{margin-bottom:0}
.literalblock pre,.listingblock pre:not(.highlight),.listingblock pre[class="highlight"],.listingblock pre[class^="highlight "],.listingblock pre.CodeRay,.listingblock pre.prettyprint{background:#f7f7f8}
.sidebarblock .literalblock pre,.sidebarblock .listingblock pre:not(.highlight),.sidebarblock .listingblock pre[class="highlight"],.sidebarblock .listingblock pre[class^="highlight "],.sidebarblock .listingblock pre.CodeRay,.sidebarblock .listingblock pre.prettyprint{background:#f2f1f1}
.literalblock pre,.literalblock pre[class],.listingblock pre,.listingblock pre[class]{-webkit-border-radius:4px;border-radius:4px;word-wrap:break-word;padding:1em;font-size:.8125em}
.literalblock pre.nowrap,.literalblock pre[class].nowrap,.listingblock pre.nowrap,.listingblock pre[class].nowrap{overflow-x:auto;white-space:pre;word-wrap:normal}
@media only screen and (min-width:768px){.literalblock pre,.literalblock pre[class],.listingblock pre,.listingblock pre[class]{font-size:.90625em}}
@media only screen and (min-width:1280px){.literalblock pre,.literalblock pre[class],.listingblock pre,.listingblock pre[class]{font-size:1em}}
.literalblock.output pre{color:#f7f7f8;background-color:rgba(0,0,0,.9)}
.listingblock pre.highlightjs{padding:0}
.listingblock pre.highlightjs>code{padding:1em;-webkit-border-radius:4px;border-radius:4px}
.listingblock pre.prettyprint{border-width:0}
.listingblock>.content{position:relative}
.listingblock code[data-lang]:before{display:none;content:attr(data-lang);position:absolute;font-size:.75em;top:.425rem;right:.5rem;line-height:1;text-transform:uppercase;color:#999}
.listingblock:hover code[data-lang]:before{display:block}
.listingblock.terminal pre .command:before{content:attr(data-prompt);padding-right:.5em;color:#999}
.listingblock.terminal pre .command:not([data-prompt]):before{content:"$"}
table.pyhltable{border-collapse:separate;border:0;margin-bottom:0;background:none}
table.pyhltable td{vertical-align:top;padding-top:0;padding-bottom:0;line-height:1.45}
table.pyhltable td.code{padding-left:.75em;padding-right:0}
pre.pygments .lineno,table.pyhltable td:not(.code){color:#999;padding-left:0;padding-right:.5em;border-right:1px solid #ddddd8}
pre.pygments .lineno{display:inline-block;margin-right:.25em}
table.pyhltable .linenodiv{background:none!important;padding-right:0!important}
.quoteblock{margin:0 1em 1.25em 1.5em;display:table}
.quoteblock>.title{margin-left:-1.5em;margin-bottom:.75em}
.quoteblock blockquote,.quoteblock blockquote p{color:rgba(0,0,0,.85);font-size:1.15rem;line-height:1.75;word-spacing:.1em;letter-spacing:0;font-style:italic;text-align:justify}
.quoteblock blockquote{margin:0;padding:0;border:0}
.quoteblock blockquote:before{content:"\201c";float:left;font-size:2.75em;font-weight:bold;line-height:.6em;margin-left:-.6em;color:#7a2518;text-shadow:0 1px 2px rgba(0,0,0,.1)}
.quoteblock blockquote>.paragraph:last-child p{margin-bottom:0}
.quoteblock .attribution{margin-top:.5em;margin-right:.5ex;text-align:right}
.quoteblock .quoteblock{margin-left:0;margin-right:0;padding:.5em 0;border-left:3px solid rgba(0,0,0,.6)}
.quoteblock .quoteblock blockquote{padding:0 0 0 .75em}
.quoteblock .quoteblock blockquote:before{display:none}
.verseblock{margin:0 1em 1.25em 1em}
.verseblock pre{font-family:"Open Sans","DejaVu Sans",sans;font-size:1.15rem;color:rgba(0,0,0,.85);font-weight:300;text-rendering:optimizeLegibility}
.verseblock pre strong{font-weight:400}
.verseblock .attribution{margin-top:1.25rem;margin-left:.5ex}
.quoteblock .attribution,.verseblock .attribution{font-size:.9375em;line-height:1.45;font-style:italic}
.quoteblock .attribution br,.verseblock .attribution br{display:none}
.quoteblock .attribution cite,.verseblock .attribution cite{display:block;letter-spacing:-.025em;color:rgba(0,0,0,.6)}
.quoteblock.abstract{margin:0 0 1.25em 0;display:block}
.quoteblock.abstract blockquote,.quoteblock.abstract blockquote p{text-align:left;word-spacing:0}
.quoteblock.abstract blockquote:before,.quoteblock.abstract blockquote p:first-of-type:before{display:none}
table.tableblock{max-width:100%;border-collapse:separate}
table.tableblock td>.paragraph:last-child p>p:last-child,table.tableblock th>p:last-child,table.tableblock td>p:last-child{margin-bottom:0}
table.tableblock,th.tableblock,td.tableblock{border:0 solid #dedede}
table.grid-all th.tableblock,table.grid-all td.tableblock{border-width:0 1px 1px 0}
table.grid-all tfoot>tr>th.tableblock,table.grid-all tfoot>tr>td.tableblock{border-width:1px 1px 0 0}
table.grid-cols th.tableblock,table.grid-cols td.tableblock{border-width:0 1px 0 0}
table.grid-all *>tr>.tableblock:last-child,table.grid-cols *>tr>.tableblock:last-child{border-right-width:0}
table.grid-rows th.tableblock,table.grid-rows td.tableblock{border-width:0 0 1px 0}
table.grid-all tbody>tr:last-child>th.tableblock,table.grid-all tbody>tr:last-child>td.tableblock,table.grid-all thead:last-child>tr>th.tableblock,table.grid-rows tbody>tr:last-child>th.tableblock,table.grid-rows tbody>tr:last-child>td.tableblock,table.grid-rows thead:last-child>tr>th.tableblock{border-bottom-width:0}
table.grid-rows tfoot>tr>th.tableblock,table.grid-rows tfoot>tr>td.tableblock{border-width:1px 0 0 0}
table.frame-all{border-width:1px}
table.frame-sides{border-width:0 1px}
table.frame-topbot{border-width:1px 0}
th.halign-left,td.halign-left{text-align:left}
th.halign-right,td.halign-right{text-align:right}
th.halign-center,td.halign-center{text-align:center}
th.valign-top,td.valign-top{vertical-align:top}
th.valign-bottom,td.valign-bottom{vertical-align:bottom}
th.valign-middle,td.valign-middle{vertical-align:middle}
table thead th,table tfoot th{font-weight:bold}
tbody tr th{display:table-cell;line-height:1.6;background:#f7f8f7}
tbody tr th,tbody tr th p,tfoot tr th,tfoot tr th p{color:rgba(0,0,0,.8);font-weight:bold}
p.tableblock>code:only-child{background:none;padding:0}
p.tableblock{font-size:1em}
td>div.verse{white-space:pre}
ol{margin-left:1.75em}
ul li ol{margin-left:1.5em}
dl dd{margin-left:1.125em}
dl dd:last-child,dl dd:last-child>:last-child{margin-bottom:0}
ol>li p,ul>li p,ul dd,ol dd,.olist .olist,.ulist .ulist,.ulist .olist,.olist .ulist{margin-bottom:.625em}
ul.unstyled,ol.unnumbered,ul.checklist,ul.none{list-style-type:none}
ul.unstyled,ol.unnumbered,ul.checklist{margin-left:.625em}
ul.checklist li>p:first-child>.fa-square-o:first-child,ul.checklist li>p:first-child>.fa-check-square-o:first-child{width:1em;font-size:.85em}
ul.checklist li>p:first-child>input[type="checkbox"]:first-child{width:1em;position:relative;top:1px}
ul.inline{margin:0 auto .625em auto;margin-left:-1.375em;margin-right:0;padding:0;list-style:none;overflow:hidden}
ul.inline>li{list-style:none;float:left;margin-left:1.375em;display:block}
ul.inline>li>*{display:block}
.unstyled dl dt{font-weight:400;font-style:normal}
ol.arabic{list-style-type:decimal}
ol.decimal{list-style-type:decimal-leading-zero}
ol.loweralpha{list-style-type:lower-alpha}
ol.upperalpha{list-style-type:upper-alpha}
ol.lowerroman{list-style-type:lower-roman}
ol.upperroman{list-style-type:upper-roman}
ol.lowergreek{list-style-type:lower-greek}
.hdlist>table,.colist>table{border:0;background:none}
.hdlist>table>tbody>tr,.colist>table>tbody>tr{background:none}
td.hdlist1,td.hdlist2{vertical-align:top;padding:0 .625em}
td.hdlist1{font-weight:bold;padding-bottom:1.25em}
.literalblock+.colist,.listingblock+.colist{margin-top:-.5em}
.colist>table tr>td:first-of-type{padding:0 .75em;line-height:1}
.colist>table tr>td:last-of-type{padding:.25em 0}
.thumb,.th{line-height:0;display:inline-block;border:solid 4px #fff;-webkit-box-shadow:0 0 0 1px #ddd;box-shadow:0 0 0 1px #ddd}
.imageblock.left,.imageblock[style*="float: left"]{margin:.25em .625em 1.25em 0}
.imageblock.right,.imageblock[style*="float: right"]{margin:.25em 0 1.25em .625em}
.imageblock>.title{margin-bottom:0}
.imageblock.thumb,.imageblock.th{border-width:6px}
.imageblock.thumb>.title,.imageblock.th>.title{padding:0 .125em}
.image.left,.image.right{margin-top:.25em;margin-bottom:.25em;display:inline-block;line-height:0}
.image.left{margin-right:.625em}
.image.right{margin-left:.625em}
a.image{text-decoration:none;display:inline-block}
a.image object{pointer-events:none}
sup.footnote,sup.footnoteref{font-size:.875em;position:static;vertical-align:super}
sup.footnote a,sup.footnoteref a{text-decoration:none}
sup.footnote a:active,sup.footnoteref a:active{text-decoration:underline}
#footnotes{padding-top:.75em;padding-bottom:.75em;margin-bottom:.625em}
#footnotes hr{width:20%;min-width:6.25em;margin:-.25em 0 .75em 0;border-width:1px 0 0 0}
#footnotes .footnote{padding:0 .375em 0 .225em;line-height:1.3334;font-size:.875em;margin-left:1.2em;text-indent:-1.05em;margin-bottom:.2em}
#footnotes .footnote a:first-of-type{font-weight:bold;text-decoration:none}
#footnotes .footnote:last-of-type{margin-bottom:0}
#content #footnotes{margin-top:-.625em;margin-bottom:0;padding:.75em 0}
.gist .file-data>table{border:0;background:#fff;width:100%;margin-bottom:0}
.gist .file-data>table td.line-data{width:99%}
div.unbreakable{page-break-inside:avoid}
.big{font-size:larger}
.small{font-size:smaller}
.underline{text-decoration:underline}
.overline{text-decoration:overline}
.line-through{text-decoration:line-through}
.aqua{color:#00bfbf}
.aqua-background{background-color:#00fafa}
.black{color:#000}
.black-background{background-color:#000}
.blue{color:#0000bf}
.blue-background{background-color:#0000fa}
.fuchsia{color:#bf00bf}
.fuchsia-background{background-color:#fa00fa}
.gray{color:#606060}
.gray-background{background-color:#7d7d7d}
.green{color:#006000}
.green-background{background-color:#007d00}
.lime{color:#00bf00}
.lime-background{background-color:#00fa00}
.maroon{color:#600000}
.maroon-background{background-color:#7d0000}
.navy{color:#000060}
.navy-background{background-color:#00007d}
.olive{color:#606000}
.olive-background{background-color:#7d7d00}
.purple{color:#600060}
.purple-background{background-color:#7d007d}
.red{color:#bf0000}
.red-background{background-color:#fa0000}
.silver{color:#909090}
.silver-background{background-color:#bcbcbc}
.teal{color:#006060}
.teal-background{background-color:#007d7d}
.white{color:#bfbfbf}
.white-background{background-color:#fafafa}
.yellow{color:#bfbf00}
.yellow-background{background-color:#fafa00}
span.icon>.fa{cursor:default}
.admonitionblock td.icon [class^="fa icon-"]{font-size:2.5em;text-shadow:1px 1px 2px rgba(0,0,0,.5);cursor:default}
.admonitionblock td.icon .icon-note:before{content:"\f05a";color:#19407c}
.admonitionblock td.icon .icon-tip:before{content:"\f0eb";text-shadow:1px 1px 2px rgba(155,155,0,.8);color:#111}
.admonitionblock td.icon .icon-warning:before{content:"\f071";color:#bf6900}
.admonitionblock td.icon .icon-caution:before{content:"\f06d";color:#bf3400}
.admonitionblock td.icon .icon-important:before{content:"\f06a";color:#bf0000}
.conum[data-value]{display:inline-block;color:#fff!important;background-color:rgba(0,0,0,.8);-webkit-border-radius:100px;border-radius:100px;text-align:center;font-size:.75em;width:1.67em;height:1.67em;line-height:1.67em;font-family:"Open Sans","DejaVu Sans",sans-serif;font-style:normal;font-weight:bold}
.conum[data-value] *{color:#fff!important}
.conum[data-value]+b{display:none}
.conum[data-value]:after{content:attr(data-value)}
pre .conum[data-value]{position:relative;top:-.125em}
b.conum *{color:inherit!important}
.conum:not([data-value]):empty{display:none}
dt,th.tableblock,td.content,div.footnote{text-rendering:optimizeLegibility}
h1,h2,p,td.content,span.alt{letter-spacing:-.01em}
p strong,td.content strong,div.footnote strong{letter-spacing:-.005em}
p,blockquote,dt,td.content,span.alt{font-size:1.0625rem}
p{margin-bottom:1.25rem}
.sidebarblock p,.sidebarblock dt,.sidebarblock td.content,p.tableblock{font-size:1em}
.exampleblock>.content{background-color:#fffef7;border-color:#e0e0dc;-webkit-box-shadow:0 1px 4px #e0e0dc;box-shadow:0 1px 4px #e0e0dc}
.print-only{display:none!important}
@media print{@page{margin:1.25cm .75cm}
*{-webkit-box-shadow:none!important;box-shadow:none!important;text-shadow:none!important}
a{color:inherit!important;text-decoration:underline!important}
a.bare,a[href^="#"],a[href^="mailto:"]{text-decoration:none!important}
a[href^="http:"]:not(.bare):after,a[href^="https:"]:not(.bare):after{content:"(" attr(href) ")";display:inline-block;font-size:.875em;padding-left:.25em}
abbr[title]:after{content:" (" attr(title) ")"}
pre,blockquote,tr,img,object,svg{page-break-inside:avoid}
thead{display:table-header-group}
svg{max-width:100%}
p,blockquote,dt,td.content{font-size:1em;orphans:3;widows:3}
h2,h3,#toctitle,.sidebarblock>.content>.title{page-break-after:avoid}
#toc,.sidebarblock,.exampleblock>.content{background:none!important}
#toc{border-bottom:1px solid #ddddd8!important;padding-bottom:0!important}
.sect1{padding-bottom:0!important}
.sect1+.sect1{border:0!important}
#header>h1:first-child{margin-top:1.25rem}
body.book #header{text-align:center}
body.book #header>h1:first-child{border:0!important;margin:2.5em 0 1em 0}
body.book #header .details{border:0!important;display:block;padding:0!important}
body.book #header .details span:first-child{margin-left:0!important}
body.book #header .details br{display:block}
body.book #header .details br+span:before{content:none!important}
body.book #toc{border:0!important;text-align:left!important;padding:0!important;margin:0!important}
body.book #toc,body.book #preamble,body.book h1.sect0,body.book .sect1>h2{page-break-before:always}
.listingblock code[data-lang]:before{display:block}
#footer{background:none!important;padding:0 .9375em}
#footer-text{color:rgba(0,0,0,.6)!important;font-size:.9em}
.hide-on-print{display:none!important}
.print-only{display:block!important}
.hide-for-print{display:none!important}
.show-for-print{display:inherit!important}}
</style>
</head>
<body class="article toc2 toc-left">
<div id="header">
<h1>APOC User Guide 3.1.2.5</h1>
<div id="toc" class="toc2">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_introduction">Introduction</a>
<ul class="sectlevel3">
<li><a href="#_license">License</a></li>
<li><a href="#__apoc_name_history">"APOC" Name history</a></li>
<li><a href="#_installation">Installation</a>
<ul class="sectlevel3">
<li><a href="#_download_latest_release">Download latest release</a></li>
<li><a href="#_version_compatibility_matrix">Version Compatibility Matrix</a></li>
<li><a href="#_using_apoc_with_neo4j_docker_image">using APOC with Neo4j Docker image</a></li>
<li><a href="#_build_install_the_current_development_branch_from_source">Build &amp; install the current development branch from source</a></li>
</ul>
</li>
<li><a href="#_calling_procedures_functions_within_cypher">Calling Procedures &amp; Functions within Cypher</a></li>
<li><a href="#_procedure_function_signatures">Procedure &amp; Function Signatures</a></li>
</ul>
</li>
<li><a href="#_help_and_usage">Help and Usage</a></li>
<li><a href="#_overview_of_apoc_procedures_functions">Overview of APOC Procedures &amp; Functions</a>
<ul class="sectlevel2">
<li><a href="#_configuration_options">Configuration Options</a></li>
<li><a href="#_manual_indexes">Manual Indexes</a>
<ul class="sectlevel3">
<li><a href="#_index_queries">Index Queries</a></li>
<li><a href="#_index_management">Index Management</a></li>
<li><a href="#_schema_index_queries">Schema Index Queries</a></li>
</ul>
</li>
<li><a href="#_meta_graph">Meta Graph</a></li>
<li><a href="#_schema">Schema</a></li>
<li><a href="#_locking">Locking</a></li>
<li><a href="#_from_tojson">from/toJson</a></li>
<li><a href="#_export_import">Export / Import</a>
<ul class="sectlevel3">
<li><a href="#_export_to_csv">Export to CSV</a></li>
<li><a href="#_export_to_cypher_script">Export to Cypher Script</a></li>
<li><a href="#_graphml_import_export">GraphML Import / Export</a></li>
</ul>
</li>
<li><a href="#_loading_data_from_rdbms">Loading Data from RDBMS</a></li>
<li><a href="#_loading_data_from_web_apis_json_xml_csv">Loading Data from Web-APIs (JSON, XML, CSV)</a></li>
<li><a href="#_interacting_with_elastic_search">Interacting with Elastic Search</a></li>
<li><a href="#_interacting_with_mongodb">Interacting with MongoDB</a></li>
<li><a href="#_interacting_with_couchbase">Interacting with Couchbase</a></li>
<li><a href="#_streaming_data_to_gephi">Streaming Data to Gephi</a>
<ul class="sectlevel3">
<li><a href="#_notes">Notes</a></li>
<li><a href="#_example">Example</a></li>
</ul>
</li>
<li><a href="#_creating_data">Creating Data</a></li>
<li><a href="#_virtual_nodes_rels">Virtual Nodes/Rels</a></li>
<li><a href="#_virtual_graph">Virtual Graph</a></li>
<li><a href="#_generating_graphs">Generating Graphs</a></li>
<li><a href="#_warmup">Warmup</a></li>
<li><a href="#_monitoring">Monitoring</a></li>
<li><a href="#_cypher_execution">Cypher Execution</a></li>
<li><a href="#_triggers">Triggers</a></li>
<li><a href="#_job_management">Job Management</a></li>
<li><a href="#_graph_refactoring">Graph Refactoring</a></li>
<li><a href="#_spatial">Spatial</a></li>
<li><a href="#_helpers">Helpers</a>
<ul class="sectlevel3">
<li><a href="#_static_value_storage">Static Value Storage</a></li>
<li><a href="#_conversion_functions">Conversion Functions</a></li>
<li><a href="#_map_functions">Map Functions</a></li>
<li><a href="#_collection_functions">Collection Functions</a></li>
<li><a href="#_lookup_functions">Lookup Functions</a></li>
<li><a href="#_math_functions">Math Functions</a></li>
<li><a href="#_text_functions">Text Functions</a></li>
<li><a href="#_phonetic_comparison_functions">Phonetic Comparison Functions</a></li>
</ul>
</li>
<li><a href="#_utilities">Utilities</a></li>
<li><a href="#_config">Config</a></li>
<li><a href="#_time_to_live_ttl">Time to Live (TTL)</a></li>
<li><a href="#_date_time_support">Date/time Support</a>
<ul class="sectlevel3">
<li><a href="#_conversion_functions_between_formatted_dates_and_timestamps">Conversion Functions between formatted dates and timestamps</a></li>
<li><a href="#_conversion_of_timestamps_between_different_time_units">Conversion of timestamps between different time units</a></li>
<li><a href="#_adding_subtracting_time_unit_values_to_timestamps">Adding/subtracting time unit values to timestamps</a></li>
<li><a href="#_reading_separate_datetime_fields">Reading separate datetime fields</a></li>
</ul>
</li>
<li><a href="#_bitwise_operations">Bitwise operations</a></li>
<li><a href="#_path_expander">Path Expander</a>
<ul class="sectlevel3">
<li><a href="#_relationship_filter">Relationship Filter</a></li>
<li><a href="#_label_filter">Label Filter</a></li>
<li><a href="#_uniqueness">Uniqueness</a></li>
</ul>
</li>
<li><a href="#_parallel_node_search">Parallel Node Search</a></li>
<li><a href="#_graph_algorithms_work_in_progress">Graph Algorithms (work in progress)</a></li>
</ul>
</li>
<li><a href="#_user_defined_functions">User Defined Functions</a></li>
<li><a href="#_text_and_lookup_indexes">Text and Lookup Indexes</a>
<ul class="sectlevel2">
<li><a href="#_index_queries_2">Index Queries</a></li>
<li><a href="#_index_management_2">Index Management</a></li>
<li><a href="#_manual_indexes_2">Manual Indexes</a>
<ul class="sectlevel3">
<li><a href="#_data_used">Data Used</a></li>
<li><a href="#_using_manual_index_on_node_properties">Using Manual Index on Node Properties</a></li>
<li><a href="#_using_manual_index_on_relationship_properties">Using Manual Index on Relationship Properties</a></li>
</ul>
</li>
<li><a href="#_full_text_search">Full Text Search</a>
<ul class="sectlevel3">
<li><a href="#_advanced_search">Advanced Search</a></li>
<li><a href="#_fulltext_and_graph_search">Fulltext and Graph Search</a></li>
<li><a href="#_complex_searches">Complex Searches</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_utility_functions">Utility Functions</a>
<ul class="sectlevel2">
<li><a href="#_phonetic_text_procedures">Phonetic Text Procedures</a></li>
<li><a href="#_extract_domain">Extract Domain</a>
<ul class="sectlevel3">
<li><a href="#_timetolive_ttl_expire_nodes">TimeToLive (TTL) - Expire Nodes</a></li>
</ul>
</li>
<li><a href="#_date_and_time_conversions">Date and Time Conversions</a>
<ul class="sectlevel3">
<li><a href="#_conversion_between_formatted_dates_and_timestamps">Conversion between formatted dates and timestamps</a></li>
<li><a href="#_conversion_of_timestamps_between_different_time_units_2">Conversion of timestamps between different time units</a></li>
<li><a href="#_adding_subtracting_time_unit_values_to_timestamps_2">Adding/subtracting time unit values to timestamps</a></li>
<li><a href="#_reading_separate_datetime_fields_2">Reading separate datetime fields:</a></li>
<li><a href="#_examples">Examples</a></li>
<li><a href="#_notes_on_formats">Notes on formats:</a></li>
</ul>
</li>
<li><a href="#_number_format_conversions">Number Format Conversions</a>
<ul class="sectlevel3">
<li><a href="#_conversion_between_formatted_decimals">Conversion between formatted decimals</a></li>
<li><a href="#_examples_2">Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_graph_algorithms">Graph Algorithms</a>
<ul class="sectlevel2">
<li><a href="#_algorithm_procedures">Algorithm Procedures</a>
<ul class="sectlevel3">
<li><a href="#_community_detection_via_label_propagation">Community Detection via Label Propagation</a></li>
</ul>
</li>
<li><a href="#_expand_paths">Expand paths</a>
<ul class="sectlevel3">
<li><a href="#_expand">Expand</a></li>
<li><a href="#_expand_with_config">Expand with Config</a></li>
<li><a href="#_expand_to_nodes_in_a_subgraph">Expand to nodes in a subgraph</a></li>
<li><a href="#_expand_to_a_subgraph_and_return_all_nodes_and_relationships_within_the_subgraph">Expand to a subgraph and return all nodes and relationships within the subgraph</a></li>
<li><a href="#_expand_a_spanning_tree">Expand a spanning tree</a></li>
</ul>
</li>
<li><a href="#_centrality_algorithms">Centrality Algorithms</a>
<ul class="sectlevel3">
<li><a href="#_setup">Setup</a></li>
<li><a href="#_closeness_centrality_procedure">Closeness Centrality Procedure</a></li>
<li><a href="#_betweenness_centrality_procedure">Betweenness Centrality Procedure</a></li>
</ul>
</li>
<li><a href="#_pagerank_algorithm">PageRank Algorithm</a>
<ul class="sectlevel3">
<li><a href="#_setup_2">Setup</a></li>
<li><a href="#_pagerank_procedure">PageRank Procedure</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_spatial_2">Spatial</a>
<ul class="sectlevel2">
<li><a href="#_spatial_functions">Spatial Functions</a>
<ul class="sectlevel3">
<li><a href="#_geocode">geocode</a></li>
<li><a href="#_configuring_geocode">Configuring Geocode</a></li>
<li><a href="#_configuring_custom_geocode_provider">Configuring Custom Geocode Provider</a></li>
<li><a href="#_using_geocode_within_a_bigger_cypher_query">Using Geocode within a bigger Cypher query</a></li>
<li><a href="#_calculating_distance_between_locations">Calculating distance between locations</a></li>
<li><a href="#_graph_refactoring_2">Graph Refactoring</a></li>
<li><a href="#_combined_space_and_time_search">Combined Space and Time search</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_data_integration">Data Integration</a>
<ul class="sectlevel2">
<li><a href="#_load_json">Load JSON</a>
<ul class="sectlevel3">
<li><a href="#_load_json_2">Load JSON</a></li>
<li><a href="#_load_json_stackoverflow_example">Load JSON StackOverflow Example</a></li>
<li><a href="#_load_json_from_twitter_with_additional_parameters">Load JSON from Twitter (with additional parameters)</a></li>
<li><a href="#_geocoding_example">GeoCoding Example</a></li>
</ul>
</li>
<li><a href="#_load_jdbc">Load JDBC</a>
<ul class="sectlevel3">
<li><a href="#_overview_database_integration">Overview: Database Integration</a></li>
<li><a href="#_mysql_example">MySQL Example</a></li>
<li><a href="#_load_jdbc_examples">Load JDBC Examples</a></li>
<li><a href="#_load_data_in_transactional_batches">Load data in transactional batches</a></li>
<li><a href="#_cassandra_example">Cassandra Example</a></li>
<li><a href="#_load_jdbc_resources">LOAD JDBC - Resources</a></li>
</ul>
</li>
<li><a href="#_streaming_data_to_gephi_2">Streaming Data to Gephi</a></li>
<li><a href="#_notes_2">Notes</a></li>
<li><a href="#_example_2">Example</a>
<ul class="sectlevel3">
<li><a href="#_format">Format</a></li>
<li><a href="#_specifics_details">Specifics Details</a></li>
</ul>
</li>
<li><a href="#_elasticsearch_integration">ElasticSearch Integration</a>
<ul class="sectlevel3">
<li><a href="#_example_3">Example</a></li>
<li><a href="#_general_structure_and_parameters">General Structure and Parameters</a></li>
</ul>
</li>
<li><a href="#_load_xml">Load XML</a>
<ul class="sectlevel3">
<li><a href="#_load_xml_introduction">Load XML Introduction</a></li>
<li><a href="#_example_file">Example File</a></li>
<li><a href="#_load_xml_and_introspect">Load XML and Introspect</a></li>
<li><a href="#_extracting_datastructures">Extracting Datastructures</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_graph_refactorings">Graph Refactorings</a>
<ul class="sectlevel2">
<li><a href="#_graph_refactoring_procedures">Graph Refactoring Procedures</a>
<ul class="sectlevel3">
<li><a href="#_normalize_boolean_properties">Normalize boolean properties</a></li>
<li><a href="#_categorization">Categorization</a></li>
</ul>
</li>
<li><a href="#_using_cypher_and_apoc_to_move_a_property_value_to_a_label">Using Cypher and APOC to move a property value to a label</a></li>
</ul>
</li>
<li><a href="#_cypher_operations">Cypher Operations</a>
<ul class="sectlevel2">
<li><a href="#_running_cypher_fragments">Running Cypher fragments</a>
<ul class="sectlevel3">
<li><a href="#_cypher_execution_2">Cypher Execution</a></li>
<li><a href="#_example_fast_node_counts_by_label">Example: Fast Node-Counts by Label</a></li>
<li><a href="#_running_a_cypher_statement_timeboxed">running a cypher statement timeboxed</a></li>
</ul>
</li>
<li><a href="#_job_management_and_periodic_execution">Job management and periodic execution</a>
<ul class="sectlevel3">
<li><a href="#_introduction_asynchronous_transactional_execution">Introduction asynchronous transactional execution</a></li>
<li><a href="#_further_functions">Further Functions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="content">
<div class="sect1">
<h2 id="_introduction"><a class="link" href="#_introduction">Introduction</a></h2>
<div class="sectionbody">
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
Go here for documentation for APOC for Neo4j version <a href="index30.html">3.0.x</a> <a href="index31.html">3.1.x</a> <a href="index32.html">3.2.x</a>
</td>
</tr>
</table>
</div>
<div class="imageblock" style="float: right">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/3.1/docs/{img}/apoc.gif" alt="apoc">
</div>
</div>
<div class="paragraph">
<p>Neo4j 3.0 introduced the concept of user defined procedures.
Those are custom implementations of certain functionality, that can&#8217;t be (easily) expressed in Cypher itself.
Those procedures are implemented in Java and can be easily deployed into your Neo4j instance, and then be called from Cypher directly.</p>
</div>
<div class="paragraph">
<p>The APOC library consists of many (about 300) procedures to help with many different tasks in areas like data integration, graph algorithms or data conversion.</p>
</div>
<div class="sect3">
<h4 id="_license"><a class="link" href="#_license">License</a></h4>
<div class="paragraph">
<p>Apache License 2.0</p>
</div>
</div>
<div class="sect3">
<h4 id="__apoc_name_history"><a class="link" href="#__apoc_name_history">"APOC" Name history</a></h4>
<div class="paragraph">
<p><a href="http://matrix.wikia.com/wiki/Apoc">Apoc</a> was the technician and driver on board of the Nebuchadnezzar in the Matrix movie. He was killed by Cypher.</p>
</div>
<div class="paragraph">
<p><strong>APOC</strong> was also the first bundled <a href="http://neo4j.com/blog/convenient-package-neo4j-apoc-0-1-released/">A Package Of Components</a> for Neo4j in 2009.</p>
</div>
<div class="paragraph">
<p><strong>APOC</strong> also stands for "Awesome Procedures On Cypher"</p>
</div>
</div>
<div class="sect2">
<h3 id="_installation"><a class="link" href="#_installation">Installation</a></h3>
<div class="sect3">
<h4 id="_download_latest_release"><a class="link" href="#_download_latest_release">Download latest release</a></h4>
<div class="paragraph">
<p>Go to <a href="http://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/3.1.2.5" class="bare">http://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/3.1.2.5</a>
to find the latest release and download the binary jar to place into your <code>$NEO4J_HOME/plugins</code> folder.</p>
</div>
</div>
<div class="sect3">
<h4 id="_version_compatibility_matrix"><a class="link" href="#_version_compatibility_matrix">Version Compatibility Matrix</a></h4>
<div class="paragraph">
<p>Since APOC relies in some places on Neo4j&#8217;s internal APIs you need to use the right APOC version for your Neo4j installaton.</p>
</div>
<div class="paragraph">
<p>Any version to be released after 1.1.0 will use a different, consistent versioning scheme: <code>&lt;neo4j-version&gt;.&lt;apoc&gt;</code> version. The trailing <code>&lt;apoc&gt;</code> part of the version number will be incremented with every apoc release.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">apoc version</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">neo4j version</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.1.0.3</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.1.0 (3.1.x)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.8.4</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.8 (3.0.x)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.4.3</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.4 (3.0.x)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">1.1.0</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.0 - 3.0.3</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">1.0.0</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">3.0.0 - 3.0.3</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_using_apoc_with_neo4j_docker_image"><a class="link" href="#_using_apoc_with_neo4j_docker_image">using APOC with Neo4j Docker image</a></h4>
<div class="paragraph">
<p>The <a href="https://hub.docker.com/_/neo4j/">Neo4j Docker image</a> allows to supply a volume for the <code>/plugins</code> folder. Download the APOC release fitting your Neo4j version to local folder <code>plugins</code> and provide it as a data volume:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-bash" data-lang="bash">mkdir plugins
pushd plugins
wget https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/download/3.1.2.5/apoc-3.1.2.5-extended.jar
popd
docker run --rm -e NEO4J_AUTH=none -p 7474:7474 -v $PWD/plugins:/plugins -p 7687:7687 neo4j:3.1.2</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_build_install_the_current_development_branch_from_source"><a class="link" href="#_build_install_the_current_development_branch_from_source">Build &amp; install the current development branch from source</a></h4>
<div class="listingblock">
<div class="content">
<pre>git clone http://github.com/neo4j-contrib/neo4j-apoc-procedures
./gradlew shadow
cp build/libs/apoc-&lt;version&gt;-SNAPSHOT-extended.jar $NEO4J_HOME/plugins/
$NEO4J_HOME/bin/neo4j restart</pre>
</div>
</div>
<div class="paragraph">
<p>A full build including running the tests can be run by <code>./gradlew build</code>.</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_calling_procedures_functions_within_cypher"><a class="link" href="#_calling_procedures_functions_within_cypher">Calling Procedures &amp; Functions within Cypher</a></h3>
<div class="paragraph">
<p>User defined <strong>Functions</strong> can be used in any expression or predicate, just like built-in functions.</p>
</div>
<div class="paragraph">
<p><strong>Procedures</strong> can be called stand-alone with <code>CALL procedure.name();</code></p>
</div>
<div class="paragraph">
<p>But you can also integrate them into your Cypher statements which makes them so much more powerful.</p>
</div>
<div class="listingblock">
<div class="title">Load JSON example</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">WITH 'https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/person.json' AS url

CALL apoc.load.json(url) YIELD value as person

MERGE (p:Person {name:person.name})
   ON CREATE SET p.age = person.age, p.children = size(person.children)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_configuration_options"><a class="link" href="#_configuration_options">Configuration Options</a></h3>
<div class="paragraph">
<p>Set these config options in <code>$NEO4J_HOME/neo4j.conf</code></p>
</div>
<div class="paragraph">
<p>All boolean options default to <strong>false</strong>, i.e. they are disabled, unless mentioned otherwise.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.trigger.enabled=true</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Enable triggers</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.ttl.enabled=true</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Enable time to live background task</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.ttl.schedule=5</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Set frequency in seconds to run ttl background task (default 60)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.import.file.enabled=true</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Enable reading local files from disk</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.export.file.enabled=true</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Enable writing local files to disk</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.jdbc.&lt;key&gt;.uri=jdbc-url-with-credentials</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store jdbc-urls under a key to be used by apoc.load.jdbc</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.&lt;key&gt;.uri=es-url-with-credentials</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store es-urls under a key to be used by elasticsearch procedures</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.mongodb.&lt;key&gt;.uri=mongodb-url-with-credentials</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store mongodb-urls under a key to be used by mongodb procedures</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.couchbase.&lt;key&gt;.uri=couchbase-url-with-credentials</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store couchbase-urls under a key to be used by couchbase procedures</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_manual_indexes"><a class="link" href="#_manual_indexes">Manual Indexes</a></h3>
<div class="sect3">
<h4 id="_index_queries"><a class="link" href="#_index_queries">Index Queries</a></h4>
<div class="paragraph">
<p>Procedures to add to and query manual indexes</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
Please note that there are (case-sensitive) <a href="http://neo4j.com/docs/developer-manual/current/#cypher-schema">automatic schema indexes</a>, for equality, non-equality, existence, range queries, starts with, ends-with and contains!
</td>
</tr>
</table>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addAllNodes('index-name',{label1:['prop1',&#8230;&#8203;],&#8230;&#8203;})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add all nodes to this full text index with the given fields, additionally populates a 'search' index field with all of them in one place</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNode(node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for each label it has</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByLabel('Label',node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given label</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByName('name',node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationship(rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for its type</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationshipByName('name',rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for the given name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.removeNodeByName('name',node) remove node from an index for the given name</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">apoc.index.removeRelationshipByName('name',rel) remove relationship from an index for the given name</p></td>
</tr>
</tbody>
</table>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/3.1/docs/{img}/apoc.index.nodes-with-score.jpg" alt="apoc.index.nodes with score" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.search('index-name', 'query') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">search for the first 100 nodes in the given full text index matching the given lucene query returned by relevance</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.nodes('Label','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on node index with the given label name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.relationships('TYPE','prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.between(node1,'TYPE',node2,'prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name bound by either or both sides (each node parameter can be null)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.out(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>outgoing</strong> relationship of the given node, <strong>returns end-nodes</strong></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.in(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>incoming</strong> relationship of the given node, <strong>returns start-nodes</strong></p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_index_management"><a class="link" href="#_index_management">Index Management</a></h4>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.list() YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lists all manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.remove('name') YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">removes manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forNodes('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual node index</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forRelationships('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual relationship index</p></td>
</tr>
</tbody>
</table>
<div class="listingblock">
<div class="title">Add node to index example</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">match (p:Person) call apoc.index.addNode(p,["name","age"]) RETURN count(*);
// 129s for 1M People
call apoc.index.nodes('Person','name:name100*') YIELD node, weight return * limit 2</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_schema_index_queries"><a class="link" href="#_schema_index_queries">Schema Index Queries</a></h4>
<div class="paragraph">
<p>Schema Index lookups that keep order and can apply limits</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.orderedRange(label,key,min,max,sort-relevance,limit) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">schema range scan which keeps index order and adds limit, values can be null, boundaries are inclusive</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.orderedByText(label,key,operator,value,sort-relevance,limit) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">schema string search which keeps index order and adds limit, operator is 'STARTS WITH' or 'CONTAINS'</p></td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="sect2">
<h3 id="_loading_data_from_rdbms"><a class="link" href="#_loading_data_from_rdbms">Loading Data from RDBMS</a></h3>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/3.1/docs/{img}/apoc-jdbc-northwind-load.jpg" alt="apoc jdbc northwind load" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','SELECT * FROM PERSON WHERE AGE &gt; 18')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.driver('org.apache.derby.jdbc.EmbeddedDriver')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">register JDBC driver of source database</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>To simplify the JDBC URL syntax and protect credentials, you can configure aliases in <code>conf/neo4j.conf</code>:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>apoc.jdbc.myDB.url=jdbc:derby:derbyDB</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON')

becomes

CALL apoc.load.jdbc('myDB','PERSON')</pre>
</div>
</div>
<div class="paragraph">
<p>The 3rd value in the <code>apoc.jdbc.&lt;alias&gt;.url=</code> effectively defines an alias to be used in  <code>apoc.load.jdbc('&lt;alias&gt;',&#8230;&#8203;.</code></p>
</div>
</div>
<div class="sect2">
<h3 id="_loading_data_from_web_apis_json_xml_csv"><a class="link" href="#_loading_data_from_web_apis_json_xml_csv">Loading Data from Web-APIs (JSON, XML, CSV)</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.json('http://example.com/map.json') YIELD value as person CREATE (p:Person) SET p = person</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from JSON URL (e.g. web-api) to import JSON as stream of values if the JSON was an array or a single value if it was a map</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.xml('http://example.com/test.xml') YIELD value as doc CREATE (p:Person) SET p.name = doc.name</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from XML URL (e.g. web-api) to import XML as single nested map with attributes and <code>_type</code>, <code>_text</code> and <code>_children</code> fields.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.csv('url',{sep:";"}) YIELD lineNo, list, map</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load CSV fom URL as stream of values<br>
config contains any of: <code>{skip:1,limit:5,header:false,sep:'TAB',ignore:['tmp'],arraySep:';',mapping:{years:{type:'int',arraySep:'-',array:false,name:'age',ignore:false}}</code></p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_interacting_with_elastic_search"><a class="link" href="#_interacting_with_elastic_search">Interacting with Elastic Search</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.stats(host-url-Key)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">elastic search statistics</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.get(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.query(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a SEARCH operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.getRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.postRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.post(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.put(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a PUT operation</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_interacting_with_couchbase"><a class="link" href="#_interacting_with_couchbase">Interacting with Couchbase</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.get(nodes, bucket, documentId) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Retrieves a couchbase json document by its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.exists(nodes, bucket, documentId) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Check whether a couchbase json document with the given ID does exist</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.insert(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Insert a couchbase json document with its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.upsert(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Insert or overwrite a couchbase json document with its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.append(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Append a couchbase json document to an existing one</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.prepend(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Prepend a couchbase json document to an existing one</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.remove(nodes, bucket, documentId) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Remove the couchbase json document identified by its unique ID</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.replace(nodes, bucket, documentId, jsonDocument) yield id, expiry, cas, mutationToken, content</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Replace the content of the couchbase json document identified by its unique ID.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.query(nodes, bucket, statement) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a plain un-parameterized N1QL statement.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.posParamsQuery(nodes, bucket, statement, params) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a N1QL statement with positional parameters.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.couchbase.namedParamsQuery(nodes, bucket, statement, paramNames, paramValues) yield queryResult</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Executes a N1QL statement with named parameters.</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>Copy these jars into the plugins directory:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>mvn dependency:copy-dependencies
cp target/dependency/java-client-2.3.1.jar target/dependency/core-io-1.3.1.jar target/dependency/rxjava-1.1.5.jar $NEO4J_HOME/plugins/</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.couchbase.get(['localhost'], 'default', 'artist:vincent_van_gogh')</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_streaming_data_to_gephi"><a class="link" href="#_streaming_data_to_gephi">Streaming Data to Gephi</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.gephi.add(url-or-key, workspace, data)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">streams provided data to Gephi</p></td>
</tr>
</tbody>
</table>
<div class="sect3">
<h4 id="_notes"><a class="link" href="#_notes">Notes</a></h4>
<div class="paragraph">
<p>Gephi has a <a href="https://marketplace.gephi.org/plugin/graph-streaming/">streaming plugin</a>, that can provide and accept <a href="https://github.com/gephi/gephi/wiki/GraphStreaming#Gephi_as_Master">JSON-graph-data</a> in a streaming fashion.</p>
</div>
<div class="paragraph">
<p>Make sure to install the plugin firsrt and activate it for your workspace (there is a new "Streaming"-tab besides "Layout"), right-click "Master"&#8594;"start" to start the server.</p>
</div>
<div class="paragraph">
<p>You can provide your workspace name (you might want to rename it before you start thes streaming), otherwise it defaults to <code>workspace0</code></p>
</div>
<div class="paragraph">
<p>The default Gephi-URL is <a href="http://localhost:8080" class="bare">http://localhost:8080</a>, resulting in <code><a href="http://localhost:8080/workspace0?operation=updateGraph" class="bare">http://localhost:8080/workspace0?operation=updateGraph</a></code></p>
</div>
<div class="paragraph">
<p>You can also configure it in <code>conf/neo4j.conf</code> via  <code>apoc.gephi.url=url</code> or <code>apoc.gephi.&lt;key&gt;.url=url</code></p>
</div>
</div>
<div class="sect3">
<h4 id="_example"><a class="link" href="#_example">Example</a></h4>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">match path = (:Person)-[:ACTED_IN]-&gt;(:Movie)
WITH path LIMIT 1000
with collect(path) as paths
call apoc.gephi.add(null,'workspace0', paths) yield nodes, relationships, time
return nodes, relationships, time</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_generating_graphs"><a class="link" href="#_generating_graphs">Generating Graphs</a></h3>
<div class="paragraph">
<p>Generate undirected (random direction) graphs with semi-real random distributions based on theoretical models.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.er(noNodes, noEdges, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Erdos-Renyi model (uniform)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.ws(noNodes, degree, beta, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Watts-Strogatz model (clusters)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.ba(noNodes, edgesPerNode, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph according to Barabasi-Albert model (preferential attachment)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.complete(noNodes, 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a complete graph (all nodes connected to all other nodes)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.generate.simple([degrees], 'label', 'type')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">generates a graph with the given degree distribution</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>Example</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.generate.ba(1000, 2, 'TestLabel', 'TEST_REL_TYPE')
CALL apoc.generate.ws(1000, null, null, null)
CALL apoc.generate.simple([2,2,2,2], null, null)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_monitoring"><a class="link" href="#_monitoring">Monitoring</a></h3>
<div class="paragraph">
<p>(thanks @ikwattro)</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.ids</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">node and relationships-ids in total and in use</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.kernel</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store information such as kernel version, start time, read-only, database-name, store-log-version etc.</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.store</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">store size information for the different types of stores</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.tx</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">number of transactions total,opened,committed,concurrent,rolled-back,last-tx-id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.monitor.locks(minWaitTime long)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">db locking information such as avertedDeadLocks, lockCount, contendedLockCount and contendedLocks etc. (enterprise)</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_cypher_execution"><a class="link" href="#_cypher_execution">Cypher Execution</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.runFile(file or url) yield row, result</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">runs each statement in the file, all semicolon separated - currently no schema operations</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.mapParallel(fragment, params, list-to-parallelize) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">executes fragment in parallel batches with the list segments being assigned to _</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_triggers"><a class="link" href="#_triggers">Triggers</a></h3>
<div class="paragraph">
<p>Enable <code>apoc.trigger.enabled=true</code> in <code>$NEO4J_HOME/config/neo4j.conf</code> first.</p>
</div>
<div class="paragraph">
<p>Helper Functions</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.trigger.nodesByLabel({assignedLabels},'Label')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">function to filter labelEntries by label, to be used within a trigger statement with {assignedLabels} and {removedLabels} {phase:'before/after/rollback'} returns previous and new trigger information</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.trigger.propertiesByKey({assignedNodeProperties},'key')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">function to filter propertyEntries by property-key, to be used within a trigger statement with {assignedNode/RelationshipProperties} and {removedNode/RelationshipProperties}. Returns [{old,new,key,node,relationship}]</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_helpers"><a class="link" href="#_helpers">Helpers</a></h3>
<div class="sect3">
<h4 id="_static_value_storage"><a class="link" href="#_static_value_storage">Static Value Storage</a></h4>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.static.get(name)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">returns statically stored value from config (apoc.static.&lt;key&gt;) or server lifetime storage</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.static.getAll(prefix)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">returns statically stored values from config (apoc.static.&lt;prefix&gt;) or server lifetime storage</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.static.set(name, value)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">stores value under key for server livetime storage, returns previously stored or configured value</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_lookup_functions"><a class="link" href="#_lookup_functions">Lookup Functions</a></h4>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.get.nodes(node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[ids]) yield node</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">quickly returns all nodes with these id&#8217;s</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.get.rels(rels</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">id</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[ids]) yield rel</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">quickly returns all relationships with these id&#8217;s</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_utilities"><a class="link" href="#_utilities">Utilities</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.util.sha1([values])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">computes the sha1 of the concatenation of all string values of the list</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.util.md5([values])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">computes the md5 of the concatenation of all string values of the list</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.util.sleep({duration})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">sleeps for &lt;duration&gt; millis, transaction termination is honored</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.util.validate(predicate, message,[params])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">raises exception if prediate evaluates to true</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_config"><a class="link" href="#_config">Config</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.config.list</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Lists the Neo4j configuration as key,value table</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.config.map</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Lists the Neo4j configuration as map</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_time_to_live_ttl"><a class="link" href="#_time_to_live_ttl">Time to Live (TTL)</a></h3>
<div class="paragraph">
<p>Enable TTL with setting in <code>neo4j.conf</code> : <code>apoc.ttl.enabled=true</code></p>
</div>
<div class="paragraph">
<p>There are some convenience procedures to expire nodes.</p>
</div>
<div class="paragraph">
<p>You can also do it yourself by running</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">SET n:TTL
SET n.ttl = timestamp() + 3600</code></pre>
</div>
</div>
<div class="paragraph">
<p>Optionally set <code>apoc.ttl.schedule=5</code> as repeat frequency.</p>
</div>
</div>
<div class="sect3">
<h4 id="_relationship_filter"><a class="link" href="#_relationship_filter">Relationship Filter</a></h4>
<div class="paragraph">
<p>Syntax: <code>[&lt;]RELATIONSHIP_TYPE1[&gt;]|[&lt;]RELATIONSHIP_TYPE2[&gt;]|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33%;">
<col style="width: 33%;">
<col style="width: 33%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">type</th>
<th class="tableblock halign-left valign-top">direction</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>OUTGOING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>INCOMING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>BOTH</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_label_filter"><a class="link" href="#_label_filter">Label Filter</a></h4>
<div class="paragraph">
<p>Syntax: <code>[+-/]LABEL1|LABEL2|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33%;">
<col style="width: 33%;">
<col style="width: 33%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">label</th>
<th class="tableblock halign-left valign-top">result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>+Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>include label (whitelist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-Foe</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Foe</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>exclude label (blacklist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>/Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>stop traversal after reaching a friend (but include him)</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_uniqueness"><a class="link" href="#_uniqueness">Uniqueness</a></h4>
<div class="paragraph">
<p>Uniqueness of nodes and relationships guides the expansion and the returned results.
Uniqueness is only configurable using <code>expandConfig()</code>.</p>
</div>
<div class="paragraph">
<p><code>subgraphNodes()</code>, <code>subgraphAll()</code>, and <code>spanningTree()</code> all use 'NODE_GLOBAL' uniqueness.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">value</th>
<th class="tableblock halign-left valign-top">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>RELATIONSHIP_PATH</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>For each returned node there&#8217;s a (relationship wise) unique path from the start node to it. This is Cypher&#8217;s default expansion mode.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NODE_GLOBAL</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>A node cannot be traversed more than once. This is what the legacy traversal framework does.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NODE_LEVEL</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Entities on the same level are guaranteed to be unique.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NODE_PATH</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>For each returned node there&#8217;s a unique path from the start node to it.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NODE_RECENT</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>This is like NODE_GLOBAL, but only guarantees uniqueness among the most recent visited nodes, with a configurable count. Traversing a huge graph is quite memory intensive in that it keeps track of all the nodes it has visited.
For huge graphs a traverser can hog all the memory in the JVM, causing OutOfMemoryError. Together with this Uniqueness you can supply a count, which is the number of most recent visited nodes. This can cause a node to be visited more than once, but scales infinitely.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>RELATIONSHIP_GLOBAL</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>A relationship cannot be traversed more than once, whereas nodes can.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>RELATIONSHIP_LEVEL</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Entities on the same level are guaranteed to be unique.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>RELATIONSHIP_RECENT</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Same as for NODE_RECENT, but for relationships.</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NONE</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>No restriction (the user will have to manage it)</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="sect1">
<h2 id="_user_defined_functions"><a class="link" href="#_user_defined_functions">User Defined Functions</a></h2>
<div class="sectionbody">
<div class="paragraph">
<p>Introduced in Neo4j 3.1.0-M10</p>
</div>
<div class="paragraph">
<p>Neo4j 3.1 brings some really neat improvements in Cypher alongside other cool features</p>
</div>
<div class="paragraph">
<p>If you used or wrote procedures in the past, you most probably came across instances where it felt quite unwieldy to call a procedure just to compute something, convert a value or provide a boolean decision.</p>
</div>
<div class="paragraph">
<p>For example:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CREATE (v:Value {id:{id}, data:{data}})
WITH v
CALL apoc.date.formatDefault(timestamp(), "ms") YIELD value as created
SET v.created = created</code></pre>
</div>
</div>
<div class="paragraph">
<p>You&#8217;d rather write it as a function:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CREATE (v:Value {id:{id}, data:{data}, created: apoc.date.format(timestamp()) })</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now in 3.1 that&#8217;s possible, and you can also leave off the <code>"ms"</code> and use a single function name, because the <code>unit</code> and <code>format</code> parameters have a default value.</p>
</div>
<div class="paragraph">
<p>Functions are more limited than procedures: they cant execute writes or schema operations and are expected to return a single value, not a stream of values.
But this makes it also easier to write and use them.</p>
</div>
<div class="paragraph">
<p>By having information about their types, the Cypher Compiler can also check for applicability.</p>
</div>
<div class="paragraph">
<p>The signature of the procedure above changed from:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-java" data-lang="java">@Procedure("apoc.date.format")
public Stream&lt;StringResult&gt; formatDefault(@Name("time") long time, @Name("unit") String unit) {
   return Stream.of(format(time, unit, DEFAULT_FORMAT));
}</code></pre>
</div>
</div>
<div class="paragraph">
<p>to the much simpler function signature (ignoring the parameter name and value annotations):</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-java" data-lang="java">@UserFunction("apoc.date.format")
public String format(@Name("time") long time,
                     @Name(value="unit", defaultValue="ms") String unit,
                     @Name(value="format", defaultValue=DEFAULT_FORMAT) String format) {
   return getFormatter().format(time, unit, format);
}</code></pre>
</div>
</div>
<div class="paragraph">
<p>This can then be called in the manner outlined above.</p>
</div>
<div class="paragraph">
<p>In our APOC procedure library we already converted about <a href="https://github.com/neo4j-contrib/neo4j-apoc-procedures/issues/144">50 procedures into functions</a> from the following areas:</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 40%;">
<col style="width: 20%;">
<col style="width: 40%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">package</th>
<th class="tableblock halign-left valign-top"># of functions</th>
<th class="tableblock halign-left valign-top">example function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>date &amp; time conversion</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>3</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.date.parse("time",["unit"],["format"])</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>number conversion</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>collection and map functions</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>JSON conversion</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>string functions</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>hash functions</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>2</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.util.md5(value)</code></p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>You can list user defined functions with <code>SHOW FUNCTIONS</code></p>
</div>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/{branch}/docs/{img}/show_functions.png" alt="show_functions">
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_text_and_lookup_indexes"><a class="link" href="#_text_and_lookup_indexes">Text and Lookup Indexes</a></h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_index_queries_2"><a class="link" href="#_index_queries_2">Index Queries</a></h3>
<div class="paragraph">
<p>Procedures to add to and query manual indexes</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
Please note that there are (case-sensitive) <a href="http://neo4j.com/docs/developer-manual/current/#cypher-schema">automatic schema indexes</a>, for equality, non-equality, existence, range queries, starts with, ends-with and contains!
</td>
</tr>
</table>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addAllNodes('index-name',{label1:['prop1',&#8230;&#8203;],&#8230;&#8203;})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add all nodes to this full text index with the given fields, additionally populates a 'search' index field with all of them in one place</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNode(node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for each label it has</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByLabel('Label',node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given label</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addNodeByName('name',node,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add node to an index for the given name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationship(rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for its type</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.addRelationshipByName('name',rel,['prop1',&#8230;&#8203;])</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">add relationship to an index for the given name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.removeNodeByName('name',node) remove node from an index for the given name</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">apoc.index.removeRelationshipByName('name',rel) remove relationship from an index for the given name</p></td>
</tr>
</tbody>
</table>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/3.1/docs/{img}/apoc.index.nodes-with-score.jpg" alt="apoc.index.nodes with score" width="600">
</div>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.search('index-name', 'query') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">search for the first 100 nodes in the given full text index matching the given lucene query returned by relevance</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.nodes('Label','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on node index with the given label name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.relationships('TYPE','prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.between(node1,'TYPE',node2,'prop:value*') YIELD rel, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name bound by either or both sides (each node parameter can be null)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.out(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>outgoing</strong> relationship of the given node, <strong>returns end-nodes</strong></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.index.in(node,'TYPE','prop:value*') YIELD node, weight</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lucene query on relationship index with the given type name for <strong>incoming</strong> relationship of the given node, <strong>returns start-nodes</strong></p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_index_management_2"><a class="link" href="#_index_management_2">Index Management</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.list() YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">lists all manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.remove('name') YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">removes manual indexes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forNodes('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual node index</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.index.forRelationships('name',{config}) YIELD type,name,config</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">gets or creates manual relationship index</p></td>
</tr>
</tbody>
</table>
<div class="listingblock">
<div class="title">Add node to index example</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">match (p:Person) call apoc.index.addNode(p,["name","age"]) RETURN count(*);
// 129s for 1M People
call apoc.index.nodes('Person','name:name100*') YIELD node, weight return * limit 2</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_manual_indexes_2"><a class="link" href="#_manual_indexes_2">Manual Indexes</a></h3>
<div class="sect3">
<h4 id="_data_used"><a class="link" href="#_data_used">Data Used</a></h4>
<div class="paragraph">
<p>The below examples use <a href="https://github.com/nicolewhite/neo4j-flights">flight data</a>.</p>
</div>
<div class="paragraph">
<p>Here is a sample subset of the data that can be load to try the procedures:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CREATE (slc:Airport {abbr:'SLC', id:14869, name:'SALT LAKE CITY INTERNATIONAL'})
CREATE (oak:Airport {abbr:'OAK', id:13796, name:'METROPOLITAN OAKLAND INTERNATIONAL'})
CREATE (bur:Airport {abbr:'BUR', id:10800, name:'BOB HOPE'})
CREATE (f2:Flight {flight_num:6147, day:2, month:1, weekday:6, year:2016})
CREATE (f9:Flight {flight_num:6147, day:9, month:1, weekday:6, year:2016})
CREATE (f16:Flight {flight_num:6147, day:16, month:1, weekday:6, year:2016})
CREATE (f23:Flight {flight_num:6147, day:23, month:1, weekday:6, year:2016})
CREATE (f30:Flight {flight_num:6147, day:30, month:1, weekday:6, year:2016})
CREATE (f2)-[:DESTINATION {arr_delay:-13, taxi_time:9}]-&gt;(oak)
CREATE (f9)-[:DESTINATION {arr_delay:-8, taxi_time:4}]-&gt;(bur)
CREATE (f16)-[:DESTINATION {arr_delay:-30, taxi_time:4}]-&gt;(slc)
CREATE (f23)-[:DESTINATION {arr_delay:-21, taxi_time:3}]-&gt;(slc)
CREATE (f30)-[:DESTINATION]-&gt;(slc)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_using_manual_index_on_node_properties"><a class="link" href="#_using_manual_index_on_node_properties">Using Manual Index on Node Properties</a></h4>
<div class="paragraph">
<p>In order to create manual index on a node property, you call <code>apoc.index.addNode</code> with the node, providing the properties to be indexed.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (a:Airport)
CALL apoc.index.addNode(a,['name'])
RETURN count(*)</code></pre>
</div>
</div>
<div class="paragraph">
<p>The statement will create the node index with the <strong>same name as the Label name(s) of the node</strong> in this case <code>Airport</code> and add the node by their properties to the index.</p>
</div>
<div class="paragraph">
<p>Once this has been added check if the node index exists using <code>apoc.index.list</code>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.list()</code></pre>
</div>
</div>
<div class="paragraph">
<p>Usually <code>apoc.index.addNode</code> would be used as part of node-creation, e.g. during LOAD CSV.
There is also <code>apoc.index.addNodes</code> for adding a list of multiple nodes at once.</p>
</div>
<div class="paragraph">
<p>Once the node index is created we can start using it.</p>
</div>
<div class="paragraph">
<p>Here are some examples:</p>
</div>
<div class="paragraph">
<p>The <code>apoc.index.nodes</code> finds nodes in a manual index using the given lucene query.</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
That makes only sense if you combine multiple properties in one lookup or use case insensitive or fuzzy matching full-text queries.
In all other cases the built in schema indexes should be used.
</td>
</tr>
</table>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.nodes('Airport','name:inter*') YIELD node AS airport, weight
RETURN airport.name, weight
LIMIT 10</code></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
Apoc index queries not only return nodes and relationships but also a weight, which is the score returned from the underlying Lucene index.
The results are also sorted by that score.
That&#8217;s especially helpful for partial and fuzzy text searches.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To remove the node index <code>Airport</code> created, use:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.remove('Airport')</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_using_manual_index_on_relationship_properties"><a class="link" href="#_using_manual_index_on_relationship_properties">Using Manual Index on Relationship Properties</a></h4>
<div class="paragraph">
<p>The procedure <code>apoc.index.addRelationship</code> is used to create a manual index on relationship properties.</p>
</div>
<div class="paragraph">
<p>As there are no schema indexes for relationships, these manual indexes can be quite useful.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (:Flight)-[r:DESTINATION]-&gt;(:Airport)
CALL apoc.index.addRelationship(r,['taxi_time'])
RETURN count(*)</code></pre>
</div>
</div>
<div class="paragraph">
<p>The statement will create the relationship index with the <strong>same name as relationship-type</strong>, in this case <code>DESTINATION</code> and add the relationship by its properties to the index.</p>
</div>
<div class="paragraph">
<p>Using <code>apoc.index.relationships</code>, we can find the relationship of type <code>DESTINATION</code> with the property <code>taxi_time</code> of 11 minutes.
We can chose to also return the start and end-node.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.relationships('DESTINATION','taxi_time:11') YIELD rel, start AS flight, end AS airport
RETURN flight_num.flight_num, airport.name;</code></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
Manual relationship indexed do not only store the relationship by its properties but also the start- and end-node.
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>That&#8217;s why we can use that information to subselect relationships not only by property but also by those nodes, which is quite powerful.</p>
</div>
<div class="paragraph">
<p>With <code>apoc.index.in</code> we can pin the node with incoming relationships (end-node) to get the start nodes for all the <code>DESTINATION</code> relationships.
For instance to find all flights arriving in 'SALT LAKE CITY INTERNATIONAL' with a taxi_time of 7 minutes we&#8217;d use:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (a:Airport {name:'SALT LAKE CITY INTERNATIONAL'})
CALL apoc.index.in(a,'DESTINATION','taxi_time:7') YIELD node AS flight
RETURN flight</code></pre>
</div>
</div>
<div class="paragraph">
<p>The opposite is <code>apoc.index.out</code>, which takes and binds end-nodes and returns start-nodes of relationships.</p>
</div>
<div class="paragraph">
<p>Really useful to quickly find a subset of relationships between nodes with many relationships (tens of thousands to millions) is <code>apoc.index.between</code>.
Here you bind both the start and end-node and provide (or not) properties of the relationships.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (f:Flight {flight_num:6147})
MATCH (a:Airport {name:'SALT LAKE CITY INTERNATIONAL'})
CALL apoc.index.between(f,'DESTINATION',a,'taxi_time:7') YIELD rel, weight
RETURN *</code></pre>
</div>
</div>
<div class="paragraph">
<p>To remove the relationship index <code>DESTINATION</code> that was created, use.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.remove('DESTINATION')</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_full_text_search"><a class="link" href="#_full_text_search">Full Text Search</a></h3>
<div class="paragraph">
<p>Indexes are used for finding nodes in the graph that further operations can then continue from.
Just like in a book where you look at the index to find a section that interest you, and then start reading from there.
A full text index allows you to find occurrences of individual words or phrases across all attributes.</p>
</div>
<div class="paragraph">
<p>In order to use the full text search feature, we have to first index our data by specifying all the attributes we want to index.
Here we create a full text index called <code>locations</code> (we will use this name when searching in the index) with our data.</p>
</div>
<div class="paragraph">
<p>Optionally you can enable tracking changes to the graph on a per index level. To do so, you need to take two actions:</p>
</div>
<div class="olist arabic">
<ol class="arabic">
<li>
<p>set <code>apoc.autoUpdate.enabled=true</code> in your <code>neo4j.conf</code>. With that setting a <code>TransactionEventHandler</code> is registered upon startup of your graph database that reflects property changes to the respective fulltext index.</p>
</li>
<li>
<p>By default index tracking is done synchronously within the same transaction. Optionally this can be done asynchronous by setting <code>apoc.autoUpdate.async=true</code>.</p>
</li>
<li>
<p>indexing is started with:</p>
</li>
</ol>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.addAllNodes('locations',{
  Company: ["name", "description"],
  Person:  ["name","address"],
  Address: ["address"]})</code></pre>
</div>
</div>
<div class="paragraph">
<p>Creating the index will take a little while since the procedure has to read through the entire database to create the index.</p>
</div>
<div class="paragraph">
<p>We can now use this index to search for nodes in the database.
The most simple case would be to search across all data for a particular word.</p>
</div>
<div class="paragraph">
<p>It does not matter which property that word exists in, any node that has that word in any of its indexed properties will be found.</p>
</div>
<div class="paragraph">
<p>If you use a name in the call, all occurrences will be found (but limited to 100 results).</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.search("locations", 'name')</code></pre>
</div>
</div>
<div class="sect3">
<h4 id="_advanced_search"><a class="link" href="#_advanced_search">Advanced Search</a></h4>
<div class="paragraph">
<p>We can further restrict our search to only searching in a particular attribute.
In order to search for a <code>Person</code> with an address in <strong>France</strong>, we use the following.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.search("locations", "Person.address:France")</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now we can search for nodes with a specific property value, and then explore their neighbourhoods visually.</p>
</div>
<div class="paragraph">
<p>But integrating it with an graph query is so much more powerful.</p>
</div>
</div>
<div class="sect3">
<h4 id="_fulltext_and_graph_search"><a class="link" href="#_fulltext_and_graph_search">Fulltext and Graph Search</a></h4>
<div class="paragraph">
<p>We could for instance search for addresses in the database that contain the word "Paris", and then find all companies registered at those addresses:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.search("locations", "Address.address:Paris~") YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
RETURN company LIMIT 50</code></pre>
</div>
</div>
<div class="paragraph">
<p>The tilde (~) instructs the index search procedure to do a fuzzy match, allowing us to find Paris even if the spelling is slightly off.</p>
</div>
<div class="paragraph">
<p>We might notice that there are addresses that contain the word Paris that are not in Paris, France.
For example there might be a Paris Street somewhere.</p>
</div>
<div class="paragraph">
<p>We can further specify that we want the text to contain both the word Paris, and the word France:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.search("locations", "+Address.address:Paris~ +France~")
YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
RETURN company LIMIT 50</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_complex_searches"><a class="link" href="#_complex_searches">Complex Searches</a></h4>
<div class="paragraph">
<p>Things start to get interesting when we look at how the different entities in Paris are connected to one another.
We can do that by finding all the entities with addresses in Paris, then creating all pairs of such entities and finding the shortest path between each such pair:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.index.search("locations", "+Address.address:Paris~ +France~") YIELD node AS addr
MATCH (addr)&lt;-[:HAS_ADDRESS]-(company:Company)
WITH collect(company) AS companies

// create unique pairs
UNWIND companies AS x UNWIND companies AS y
WITH x, y WHERE ID(x) &lt; ID(y)

MATCH path = shortestPath((x)-[*..10]-(y))
RETURN path</code></pre>
</div>
</div>
<div class="paragraph">
<p>For more details on the query syntax used in the second parameter of the <code>search</code> procedure,
please see <a href="http://www.lucenetutorial.com/lucene-query-syntax.html">this Lucene query tutorial</a></p>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_utility_functions"><a class="link" href="#_utility_functions">Utility Functions</a></h2>
<div class="sectionbody">
<div class="sect3">
<h4 id="_timetolive_ttl_expire_nodes"><a class="link" href="#_timetolive_ttl_expire_nodes">TimeToLive (TTL) - Expire Nodes</a></h4>
<div class="paragraph">
<p>Enable cleanup of expired nodes in <code>neo4j.conf</code> with <code>apoc.ttl.enabled=true</code></p>
</div>
<div class="paragraph">
<p>30s after startup an index is created:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CREATE INDEX FOR (n:TTL) ON (n.ttl)</code></pre>
</div>
</div>
<div class="paragraph">
<p>At startup a statement is scheduled to run every 60s (or configure in <code>neo4j.conf</code> -  <code>apoc.ttl.schedule=120</code>)</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (t:TTL) where t.ttl &lt; timestamp() WITH t LIMIT 1000 DETACH DELETE t</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>ttl</code> property holds the <strong>time when the node is expired in milliseconds since epoch</strong>.</p>
</div>
<div class="paragraph">
<p>You can expire your nodes by setting the :TTL label and the ttl property:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (n:Foo) WHERE n.bar SET n:TTL, n.ttl = timestamp() + 10000;</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_graph_algorithms"><a class="link" href="#_graph_algorithms">Graph Algorithms</a></h2>
<div class="sectionbody">
<div class="sect5">
<h6 id="_relationship_filter_2"><a class="link" href="#_relationship_filter_2">Relationship Filter</a></h6>
<div class="paragraph">
<p>Syntax: <code>[&lt;]RELATIONSHIP_TYPE1[&gt;]|[&lt;]RELATIONSHIP_TYPE2[&gt;]|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33%;">
<col style="width: 33%;">
<col style="width: 33%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">type</th>
<th class="tableblock halign-left valign-top">direction</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>LIKES</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>OUTGOING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>FOLLOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>INCOMING</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>KNOWS</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>BOTH</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
<div class="sect5">
<h6 id="_label_filter_2"><a class="link" href="#_label_filter_2">Label Filter</a></h6>
<div class="paragraph">
<p>Syntax: <code>[+-/]LABEL1|LABEL2|&#8230;&#8203;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 33%;">
<col style="width: 33%;">
<col style="width: 33%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">input</th>
<th class="tableblock halign-left valign-top">label</th>
<th class="tableblock halign-left valign-top">result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>+Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>include label (whitelist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-Foe</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Foe</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>exclude label (blacklist)</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>/Friend</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Friend</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>stop traversal after reaching a friend (but include him)</p>
</div></div></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_centrality_algorithms"><a class="link" href="#_centrality_algorithms">Centrality Algorithms</a></h3>
<div class="sect3">
<h4 id="_setup"><a class="link" href="#_setup">Setup</a></h4>
<div class="paragraph">
<p>Let&#8217;s create some test data to run the Centrality algorithms on.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">// create 100 nodes
FOREACH (id IN range(0,1000) | CREATE (:Node {id:id}))

// over the cross product (1M) create 100.000 relationships
MATCH (n1:Node),(n2:Node) WITH n1,n2 LIMIT 1000000 WHERE rand() &lt; 0.1

CREATE (n1)-[:TYPE]-&gt;(n2)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_pagerank_algorithm"><a class="link" href="#_pagerank_algorithm">PageRank Algorithm</a></h3>
<div class="sect3">
<h4 id="_setup_2"><a class="link" href="#_setup_2">Setup</a></h4>
<div class="paragraph">
<p>Let&#8217;s create some test data to run the PageRank algorithm on.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">// create 100 nodes
FOREACH (id IN range(0,1000) | CREATE (:Node {id:id}))

// over the cross product (1M) create 100.000 relationships
MATCH (n1:Node),(n2:Node) WITH n1,n2 LIMIT 1000000 WHERE rand() &lt; 0.1

CREATE (n1)-[:TYPE_1]-&gt;(n2)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_graph_refactoring_2"><a class="link" href="#_graph_refactoring_2">Graph Refactoring</a></h4>
<div class="paragraph">
<p>In order not to have to repeatedly geocode the same thing in multiple queries, especially
if the database will be used by many people, it might be a good idea to persist the results
in the database so that subsequent calls can use the saved results.</p>
</div>
<div class="paragraph">
<p>Geocode and persist the result</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (a:Place)
WHERE a.address IS NOT NULL AND a.latitude IS NULL
WITH a LIMIT 1000
CALL apoc.spatial.geocodeOnce(a.address) YIELD location
SET a.latitude = location.latitude
SET a.longitude = location.longitude</code></pre>
</div>
</div>
<div class="paragraph">
<p>Note that the above command only geocodes the first 1000 Place nodes that have not already been geocoded.
This query can be run multiple times until all places are geocoded. Why would we want to do this?
Two good reasons:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>The geocoding service is a public service that can throttle or blacklist sites that hit the service too heavily, so controlling how much we do is useful.</p>
</li>
<li>
<p>The transaction is updating the database, and it is wise not to update the database with too many things in the same transaction, to avoid using up too much memory. This trick will keep the memory usage very low.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Now make use of the results in distance queries</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">WITH point({latitude: 48.8582532, longitude: 2.294287}) AS eiffel
MATCH (a:Place)
WHERE a.latitude IS NOT NULL AND a.longitude IS NOT NULL
WITH a, point.distance(point(a), eiffel) AS distance
WHERE distance &lt; 5000
RETURN a.name, distance
ORDER BY distance
LIMIT 100</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_combined_space_and_time_search"><a class="link" href="#_combined_space_and_time_search">Combined Space and Time search</a></h4>
<div class="paragraph">
<p>Combining spatial and date-time procedures can allow for more complex queries:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.date.parse('2016-06-01 00:00:00','h') YIELD value AS due_date
WITH due_date,
point({latitude: 48.8582532, longitude: 2.294287}) AS eiffel
MATCH (e:Event)
WHERE e.address IS NOT NULL AND e.datetime IS NOT NULL
CALL apoc.spatial.geocodeOnce(e.address) YIELD location
CALL apoc.date.parse(e.datetime,'h') YIELD value AS hours
WITH e, location,
distance(point(location), eiffel) AS distance,
            (due_date - hours)/24.0 AS days_before_due
WHERE distance &lt; 5000 AND days_before_due &lt; 14 AND hours &lt; due_date
RETURN e.name AS event, e.datetime AS date,
location.description AS description, distance
ORDER BY distance</code></pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_load_jdbc"><a class="link" href="#_load_jdbc">Load JDBC</a></h3>
<div class="sect3">
<h4 id="_overview_database_integration"><a class="link" href="#_overview_database_integration">Overview: Database Integration</a></h4>
<div class="paragraph">
<p>Data Integration is an important topic.
Reading data from relational databases to create and augment data models is a very helpful exercise.</p>
</div>
<div class="paragraph">
<p>With <code>apoc.load.jdbc</code> you can access any database that provides a JDBC driver, and execute queries whose results are turned into streams of rows.
Those rows can then be used to update or create graph structures.</p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON') YIELD row CREATE (:Person {name:row.name})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.jdbc('jdbc:derby:derbyDB','SELECT * FROM PERSON WHERE AGE &gt; 18')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">load from relational database, either a full table or a sql statement</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.load.driver('org.apache.derby.jdbc.EmbeddedDriver')</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">register JDBC driver of source database</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>To simplify the JDBC URL syntax and protect credentials, you can configure aliases in <code>conf/neo4j.conf</code>:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>apoc.jdbc.myDB.url=jdbc:derby:derbyDB</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>CALL apoc.load.jdbc('jdbc:derby:derbyDB','PERSON')

becomes

CALL apoc.load.jdbc('myDB','PERSON')</pre>
</div>
</div>
<div class="paragraph">
<p>The 3rd value in the <code>apoc.jdbc.&lt;alias&gt;.url=</code> effectively defines an alias to be used in  <code>apoc.load.jdbc('&lt;alias&gt;',&#8230;&#8203;.</code></p>
</div>
</div>
<div class="sect3">
<h4 id="_mysql_example"><a class="link" href="#_mysql_example">MySQL Example</a></h4>
<div class="paragraph">
<p>Northwind is a common example set for relational databases, which is also covered in our import guides, e.g. <a play-topic='northwind graph'>:play northwind graph</a> in the Neo4j browser.</p>
</div>
<div class="sect4">
<h5 id="_mysql_northwind_data"><a class="link" href="#_mysql_northwind_data">MySQL Northwind Data</a></h5>
<div class="listingblock">
<div class="content">
<pre>select count(*) from products;
+----------+
| count(*) |
+----------+
|       77 |
+----------+
1 row in set (0,00 sec)</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>describe products;
+-----------------+---------------+------+-----+---------+----------------+
| Field           | Type          | Null | Key | Default | Extra          |
+-----------------+---------------+------+-----+---------+----------------+
| ProductID       | int(11)       | NO   | PRI | NULL    | auto_increment |
| ProductName     | varchar(40)   | NO   | MUL | NULL    |                |
| SupplierID      | int(11)       | YES  | MUL | NULL    |                |
| CategoryID      | int(11)       | YES  | MUL | NULL    |                |
| QuantityPerUnit | varchar(20)   | YES  |     | NULL    |                |
| UnitPrice       | decimal(10,4) | YES  |     | 0.0000  |                |
| UnitsInStock    | smallint(2)   | YES  |     | 0       |                |
| UnitsOnOrder    | smallint(2)   | YES  |     | 0       |                |
| ReorderLevel    | smallint(2)   | YES  |     | 0       |                |
| Discontinued    | bit(1)        | NO   |     | b'0'    |                |
+-----------------+---------------+------+-----+---------+----------------+
10 rows in set (0,00 sec)</pre>
</div>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_load_jdbc_examples"><a class="link" href="#_load_jdbc_examples">Load JDBC Examples</a></h4>
<div class="listingblock">
<div class="title">Load the JDBC driver</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">cypher CALL apoc.load.driver("com.mysql.jdbc.Driver");</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Count rows in products table</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">with "jdbc:mysql://localhost:3306/northwind?user=root" as url
cypher CALL apoc.load.jdbc(url,"products") YIELD row
RETURN count(*);</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+----------+
| count(*) |
+----------+
| 77       |
+----------+
1 row
23 ms</pre>
</div>
</div>
<div class="listingblock">
<div class="title">Return row from products table</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">with "jdbc:mysql://localhost:3306/northwind?user=root" as url
cypher CALL apoc.load.jdbc(url,"products") YIELD row
RETURN row limit 1;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------------------------------------------------------------------------------+
| row                                                                            |
+--------------------------------------------------------------------------------+
| {UnitPrice -&gt; 18.0000, UnitsOnOrder -&gt; 0, CategoryID -&gt; 1, UnitsInStock -&gt; 39} |
+--------------------------------------------------------------------------------+
1 row
10 ms</pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/3.1/docs/{img}/apoc-load-jdbc.jpg" alt="apoc load jdbc" width="800">
</div>
</div>
</div>
<div class="sect3">
<h4 id="_load_data_in_transactional_batches"><a class="link" href="#_load_data_in_transactional_batches">Load data in transactional batches</a></h4>
<div class="paragraph">
<p>You can load data from jdbc and create/update the graph using the query results in batches (and in parallel).</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.periodic.iterate('
call apoc.load.jdbc("jdbc:mysql://localhost:3306/northwind?user=root","company")',
'CREATE (p:Person) SET p += value', {batchSize:10000, parallel:true})
RETURN batches, total</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_cassandra_example"><a class="link" href="#_cassandra_example">Cassandra Example</a></h4>
<div class="paragraph">
<p>Setup Song database as initial dataset</p>
</div>
<div class="listingblock">
<div class="content">
<pre>curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/playlist.cql
curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/artists.csv
curl -OL https://raw.githubusercontent.com/neo4j-contrib/neo4j-cassandra-connector/master/db_gen/songs.csv
$CASSANDRA_HOME/bin/cassandra
$CASSANDRA_HOME/bin/cqlsh -f playlist.cql</pre>
</div>
</div>
<div class="paragraph">
<p>Download the <a href="https://github.com/adejanovski/cassandra-jdbc-wrapper#installing">Cassandra JDBC Wrapper</a>, and put it into your <code>$NEO4J_HOME/plugins</code> directory.
Add this config option to <code>$NEO4J_HOME/conf/neo4j.conf</code> to make it easier to interact with the cassandra instance.</p>
</div>
<div class="listingblock">
<div class="title">Add to conf/neo4j.conf</div>
<div class="content">
<pre>apoc.jdbc.cassandra_songs.url=jdbc:cassandra://localhost:9042/playlist</pre>
</div>
</div>
<div class="paragraph">
<p>Restart the server.</p>
</div>
<div class="paragraph">
<p>Now you can inspect the data in Cassandra with.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN count(*);</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
count(*)

3605    
</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN row LIMIT 5;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','artists_by_first_letter') yield row
RETURN row.first_letter, row.artist LIMIT 5;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
row.first_letterrow.artist                     

C               C.W. Stoneking                 

C               CH2K                           

C               CHARLIE HUNTER WITH LEON PARKER

C               Calvin Harris                  

C               Caman                         
</pre>
</div>
</div>
<div class="paragraph">
<p>Let&#8217;s create some graph data, we have a look at the track_by_artist table, which contains about 60k records.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row RETURN count(*);</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
RETURN row LIMIT 5;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
RETURN row.track_id, row.track_length_in_seconds, row.track, row.music_file, row.genre, row.artist, row.starred LIMIT 2;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
row.track_id                        lengthrow.track       row.music_file    row.genrerow.artist                  row.starred

c0693b1e-0eaa-4e81-b23f-b083db303842219   1913 Massacre   TRYKHMD128F934154Cfolk     Woody Guthrie &amp; Jack Elliottfalse      

7d114937-0bc7-41c7-8e0c-94b5654ac77f178   Alabammy Bound  TRMQLPV128F934152Bfolk     Woody Guthrie &amp; Jack Elliottfalse      
</pre>
</div>
</div>
<div class="paragraph">
<p>Let&#8217;s create some indexes and constraints, note that other indexes and constraints will be dropped by this.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.schema.assert(
  {Track:['title','length']},
  {Artist:['name'],Track:['id'],Genre:['name']});</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
label       key    uniqueaction 

Track       title  false CREATED

Track       length false CREATED

Artist      name   true  CREATED

Genre       name   true  CREATED

Track       id     true  CREATED
</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL apoc.load.jdbc('cassandra_songs','track_by_artist') yield row
MERGE (a:Artist {name:row.artist})
MERGE (g:Genre {name:row.genre})
CREATE (t:Track {id:toString(row.track_id), title:row.track, length:row.track_length_in_seconds})
CREATE (a)-[:PERFORMED]-&gt;(t)
CREATE (t)-[:GENRE]-&gt;(g);</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>Added 63213 labels, created 63213 nodes, set 182413 properties, created 119200 relationships, statement executed in 40076 ms.</pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_load_jdbc_resources"><a class="link" href="#_load_jdbc_resources">LOAD JDBC - Resources</a></h4>
<div class="paragraph">
<p>To use other JDBC drivers use these download links and JDBC URL.
Put the JDBC driver into the <code>$NEO4J_HOME/plugins</code> directory and configure the JDBC-URL in <code>$NEO4J_HOME/conf/neo4j.conf</code> with <code>apoc.jdbc.&lt;alias&gt;.url=&lt;jdbc-url&gt;</code></p>
</div>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 20%;">
<col style="width: 60%;">
<col style="width: 20%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Database</th>
<th class="tableblock halign-left valign-top">JDBC-URL</th>
<th class="tableblock halign-left valign-top">Driver Source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>MySQL</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:mysql://&lt;hostname&gt;:&lt;port/3306&gt;/&lt;database&gt;?user=&lt;user&gt;&amp;password=&lt;pass&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="http://dev.mysql.com/downloads/connector/j/">MySQL Driver</a></p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Postgres</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:postgresql://&lt;hostname&gt;/&lt;database&gt;?user=&lt;user&gt;&amp;password=&lt;pass&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="https://jdbc.postgresql.org/download.html">PostgresSQL JDBC Driver</a></p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Oracle</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:oracle:thin:&lt;user&gt;/&lt;pass&gt;@&lt;host&gt;:&lt;port&gt;/&lt;service_name&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="http://www.oracle.com/technetwork/database/features/jdbc/index.html">Oracle JDBC Driver</a></p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>MS SQLServer</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:sqlserver://;servername=&lt;servername&gt;;databaseName=&lt;database&gt;;user=&lt;user&gt;;password=&lt;pass&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="https://www.microsoft.com/en-us/download/details.aspx?id=11774">SQLServer Driver</a></p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>IBM DB2</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:db2://&lt;host&gt;:&lt;port/5021&gt;/&lt;database&gt;:user=&lt;user&gt;;password=&lt;pass&gt;;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="http://www-01.ibm.com/support/docview.wss?uid=swg21363866">DB2 Driver</a></p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Derby</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:derby:derbyDB</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Included in JDK6-8</p>
</div></div></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p>Cassandra</p>
</div></div></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>jdbc:cassandra://&lt;host&gt;:&lt;port/9042&gt;/&lt;database&gt;</code></p></td>
<td class="tableblock halign-left valign-top"><div><div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>

</div>
<div class="paragraph">
<p><a href="https://github.com/adejanovski/cassandra-jdbc-wrapper#installing">Cassandra JDBC Wrapper</a></p>
</div></div></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>There are a number of blog posts / examples that details usage of apoc.load.jdbc</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="https://jesusbarrasa.wordpress.com/2016/09/30/quickgraph4-explore-your-browser-history-in-neo4j/">Explore your browser history in Neo4j</a></p>
</li>
<li>
<p><a href="https://blog.knoldus.com/2016/09/12/neo4j-with-scala-migrate-data-from-other-database-to-neo4j/">Neo4j With Scala : Migrate Data From Other Database to Neo4j</a>
*</p>
</li>
<li>
<p><a href="https://neo4j.com/blog/apoc-database-integration-import-export-cypher/">APOC: Database Integration, Import and Export with Awesome Procedures available on Cypher</a></p>
</li>
</ul>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_streaming_data_to_gephi_2"><a class="link" href="#_streaming_data_to_gephi_2">Streaming Data to Gephi</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.gephi.add(url-or-key, workspace, data)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">streams provided data to Gephi</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_notes_2"><a class="link" href="#_notes_2">Notes</a></h3>
<div class="paragraph">
<p>Gephi has a <a href="https://marketplace.gephi.org/plugin/graph-streaming/">streaming plugin</a>, that can provide and accept <a href="https://github.com/gephi/gephi/wiki/GraphStreaming#Gephi_as_Master">JSON-graph-data</a> in a streaming fashion.</p>
</div>
<div class="paragraph">
<p>Make sure to install the plugin firsrt and activate it for your workspace (there is a new "Streaming"-tab besides "Layout"), right-click "Master"&#8594;"start" to start the server.</p>
</div>
<div class="paragraph">
<p>You can provide your workspace name (you might want to rename it before you start thes streaming), otherwise it defaults to <code>workspace0</code></p>
</div>
<div class="paragraph">
<p>The default Gephi-URL is <a href="http://localhost:8080" class="bare">http://localhost:8080</a>, resulting in <code><a href="http://localhost:8080/workspace0?operation=updateGraph" class="bare">http://localhost:8080/workspace0?operation=updateGraph</a></code></p>
</div>
<div class="paragraph">
<p>You can also configure it in <code>conf/neo4j.conf</code> via  <code>apoc.gephi.url=url</code> or <code>apoc.gephi.&lt;key&gt;.url=url</code></p>
</div>
</div>
<div class="sect2">
<h3 id="_example_2"><a class="link" href="#_example_2">Example</a></h3>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">match path = (:Person)-[:ACTED_IN]-&gt;(:Movie)
WITH path LIMIT 1000
with collect(path) as paths
call apoc.gephi.add(null,'workspace0', paths) yield nodes, relationships, time
return nodes, relationships, time</code></pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/docs/{img}/apoc-gephi.gif" alt="apoc gephi" width="800">
</div>
</div>
<div class="sect3">
<h4 id="_format"><a class="link" href="#_format">Format</a></h4>
<div class="paragraph">
<p>We send all nodes and relationships of the passed in data convert into individual Gephi-Streaming JSON fragements, separated by <code>\r\n</code>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-javascript" data-lang="javascript">{"an":{"123":{"TYPE":"Person:Actor","label":"Tom Hanks",                           x:333,y:222,r:0.1,g:0.3,b:0.5}}}\r\n
{"an":{"345":{"TYPE":"Movie","label":"Forrest Gump",                               x:234,y:122,r:0.2,g:0.2,b:0.7}}}\r\n
{"ae":{"3344":{"TYPE":"ACTED_IN","label":"Tom Hanks",source:"123",target:"345","directed":true,r:0.1,g:0.3,b:0.5}}}</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_specifics_details"><a class="link" href="#_specifics_details">Specifics Details</a></h4>
<div class="paragraph">
<p>Gephi doesn&#8217;t render the graph data unless you also provide x,y coordinates in the payload, so we just send random ones within a 1000x1000 grid.</p>
</div>
<div class="paragraph">
<p>We also generate colors per label combination and relationship-type, both of which are also transferred as <code>TYPE</code> property.</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_elasticsearch_integration"><a class="link" href="#_elasticsearch_integration">ElasticSearch Integration</a></h3>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 60%;">
<col style="width: 40%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.stats(host-url-Key)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">elastic search statistics</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.get(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.query(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a SEARCH operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.getRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw GET operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.postRaw(host-or-port,path,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a raw POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.post(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a POST operation</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>apoc.es.put(host-or-port,index-or-null,type-or-null,query-or-null,payload-or-null) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">perform a PUT operation</p></td>
</tr>
</tbody>
</table>
<div class="sect3">
<h4 id="_example_3"><a class="link" href="#_example_3">Example</a></h4>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.es.post("localhost","tweets","users","1",null,{name:"Chris"})</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.es.get("localhost","tweets","users","1",null,null)</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.es.stats("localhost")</code></pre>
</div>
</div>
<div class="imageblock">
<div class="content">
<img src="http://i.imgur.com/qHAj9ma.png" alt="qHAj9ma" width="500">
</div>
</div>
</div>
<div class="sect3">
<h4 id="_general_structure_and_parameters"><a class="link" href="#_general_structure_and_parameters">General Structure and Parameters</a></h4>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.es.post(host-or-port,index-or-null,type-or-null,id-or-null,query-or-null,payload-or-null) yield value

// GET/PUT/POST url/index/type/id?query -d payload</code></pre>
</div>
</div>
<div class="sect4">
<h5 id="_host_or_port_parameter"><a class="link" href="#_host_or_port_parameter">host or port parameter</a></h5>
<div class="paragraph">
<p>The parameter can be a direct host or url, or an entry to be lookup up in neo4j.conf</p>
</div>
<div class="ulist">
<ul>
<li>
<p>host</p>
</li>
<li>
<p>host:port</p>
</li>
<li>
<p><a href="http://host:port" class="bare">http://host:port</a></p>
</li>
<li>
<p>lookup via key to apoc.es.&lt;key&gt;.url</p>
</li>
<li>
<p>lookup via key apoc.es.&lt;key&gt;.host</p>
</li>
<li>
<p>lookup apoc.es.url</p>
</li>
<li>
<p>lookup apoc.es.host</p>
</li>
</ul>
</div>
</div>
<div class="sect4">
<h5 id="_index_parameter"><a class="link" href="#_index_parameter">index parameter</a></h5>
<div class="paragraph">
<p>Main ES index, will be sent directly, if null then "_all" multiple indexes can be separated by comma in the string.</p>
</div>
</div>
<div class="sect4">
<h5 id="_type_parameter"><a class="link" href="#_type_parameter">type parameter</a></h5>
<div class="paragraph">
<p>Document type, will be sent directly, if null then "_all" multiple types can be separated by comma in the string.</p>
</div>
</div>
<div class="sect4">
<h5 id="_id_parameter"><a class="link" href="#_id_parameter">id parameter</a></h5>
<div class="paragraph">
<p>Document id, will be left off when null.</p>
</div>
</div>
<div class="sect4">
<h5 id="_query_parameter"><a class="link" href="#_query_parameter">query parameter</a></h5>
<div class="paragraph">
<p>Query can be a map which is turned into a query string, a direct string or null then it is left off.</p>
</div>
</div>
<div class="sect4">
<h5 id="_payload_parameter"><a class="link" href="#_payload_parameter">payload parameter</a></h5>
<div class="paragraph">
<p>Payload can be a <strong>map</strong> which will be turned into a json payload or a string which will be sent directly or null.</p>
</div>
</div>
<div class="sect4">
<h5 id="_results"><a class="link" href="#_results">Results</a></h5>
<div class="paragraph">
<p>Results are stream of map in value.</p>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_load_xml"><a class="link" href="#_load_xml">Load XML</a></h3>
<div class="sect3">
<h4 id="_load_xml_introduction"><a class="link" href="#_load_xml_introduction">Load XML Introduction</a></h4>
<div class="paragraph">
<p>Many existing (enterprise) applications, endpoints and files use XML as data exchange format.</p>
</div>
<div class="paragraph">
<p>To make these Data Structures available to Cypher, you can use <code>apoc.load.xml</code>.
It takes a file or http URL and parses the XML into a map Data Structure.</p>
</div>
<div class="paragraph">
<p>See the following usage-examples for the procedures.</p>
</div>
</div>
<div class="sect3">
<h4 id="_example_file"><a class="link" href="#_example_file">Example File</a></h4>
<div class="paragraph">
<p>"How do you access XML doc attributes in children fields ?"</p>
</div>
<div class="paragraph">
<p>(Thanks Nicolas Rouyer)</p>
</div>
<div class="paragraph">
<p>For example, if my XML file is the example <a href="https://msdn.microsoft.com/en-us/library/ms762271%28v=vs.85%29.aspx">book.xml provided by Microsoft</a>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-xml" data-lang="xml">&lt;?xml version="1.0"?&gt;
&lt;catalog&gt;
   &lt;book id="bk101"&gt;
      &lt;author&gt;Gambardella, Matthew&lt;/author&gt;
      &lt;title&gt;XML Developer's Guide&lt;/title&gt;
      &lt;genre&gt;Computer&lt;/genre&gt;
      &lt;price&gt;44.95&lt;/price&gt;
      &lt;publish_date&gt;2000-10-01&lt;/publish_date&gt;
      &lt;description&gt;An in-depth look at creating applications
      with XML.&lt;/description&gt;
   &lt;/book&gt;
   &lt;book id="bk102"&gt;
      &lt;author&gt;Ralls, Kim&lt;/author&gt;
      &lt;title&gt;Midnight Rain&lt;/title&gt;
      &lt;genre&gt;Fantasy&lt;/genre&gt;
      &lt;price&gt;5.95&lt;/price&gt;
      &lt;publish_date&gt;2000-12-16&lt;/publish_date&gt;
      &lt;description&gt;A former architect battles corporate zombies,
...</code></pre>
</div>
</div>
<div class="paragraph">
<p>We have the file here, <a href="https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml">on GitHub</a>.</p>
</div>
</div>
<div class="sect3">
<h4 id="_load_xml_and_introspect"><a class="link" href="#_load_xml_and_introspect">Load XML and Introspect</a></h4>
<div class="paragraph">
<p>Let&#8217;s just load it and see what it looks like.
It&#8217;s returned as value map with nested <code>_type</code> and <code>_children</code> fields, per group of elements.
Attributes are turned into map-entries.
And each element into their own little map with <code>_type</code>, attributes and <code>_children</code> if applicable.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml")</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-javascript" data-lang="javascript">{_type: catalog, _children: [
  {_type: book, id: bk101, _children: [
    {_type: author, _text: Gambardella, Matthew},
    {_type: title, _text: XML Developer's Guide},
    {_type: genre, _text: Computer},
    {_type: price, _text: 44.95},
    {_type: publish_date, _text: 2000-10-01},
    {_type: description, _text: An in-depth look at creating applications ....</code></pre>
</div>
</div>
<div class="sect4">
<h5 id="_for_each_book_how_do_i_access_book_id"><a class="link" href="#_for_each_book_how_do_i_access_book_id">For each book, how do I access book id ?</a></h5>
<div class="paragraph">
<p>You can access attributes per element directly.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
RETURN book.id</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
book.id

bk101  

bk102  </pre>
</div>
</div>
</div>
<div class="sect4">
<h5 id="_for_each_book_how_do_i_access_book_author_and_title"><a class="link" href="#_for_each_book_how_do_i_access_book_author_and_title">For each book, how do I access book author and title ?</a></h5>
<div class="sect5">
<h6 id="_filter_into_collection"><a class="link" href="#_filter_into_collection">Filter into collection</a></h6>
<div class="paragraph">
<p>You have to filter over the sub-elements  in the <code>_childrens</code> array in this case.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
RETURN book.id, [attr IN book._children WHERE attr._type IN ['author','title'] | [attr._type, attr._text]] as pairs</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
book.idpairs                                                                   

bk101  [[author, Gambardella, Matthew], [title, XML Developer's Guide]]        

bk102  [[author, Ralls, Kim], [title, Midnight Rain]]                          </pre>
</div>
</div>
</div>
<div class="sect5">
<h6 id="_how_do_i_return_collection_elements"><a class="link" href="#_how_do_i_return_collection_elements">How do I return collection elements?</a></h6>
<div class="paragraph">
<p>This is not too nice, we could also just have returned the values and then grabbed them out of the list, but that relies on element-order.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call apoc.load.xml("https://raw.githubusercontent.com/neo4j-contrib/neo4j-apoc-procedures/master/src/test/resources/books.xml") yield value as catalog
UNWIND catalog._children as book
WITH book.id as id, [attr IN book._children WHERE attr._type IN ['author','title'] | attr._text] as pairs
RETURN id, pairs[0] as author, pairs[1] as title</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>
id   author              title                         

bk101Gambardella, MatthewXML Developer's Guide         

bk102Ralls, Kim          Midnight Rain                 </pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_cypher_operations"><a class="link" href="#_cypher_operations">Cypher Operations</a></h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_running_cypher_fragments"><a class="link" href="#_running_cypher_fragments">Running Cypher fragments</a></h3>
<div class="paragraph">
<p>We can use Cypher as safe, graph-aware, partially compiled scripting language within APOC.</p>
</div>
<div class="sect3">
<h4 id="_cypher_execution_2"><a class="link" href="#_cypher_execution_2">Cypher Execution</a></h4>
<table class="tableblock frame-all grid-all spread">
<colgroup>
<col style="width: 16%;">
<col style="width: 83%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.runFile(file or url) yield row, result</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">runs each statement in the file, all semicolon separated - currently no schema operations</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>CALL apoc.cypher.mapParallel(fragment, params, list-to-parallelize) yield value</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">executes fragment in parallel batches with the list segments being assigned to _</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect3">
<h4 id="_example_fast_node_counts_by_label"><a class="link" href="#_example_fast_node_counts_by_label">Example: Fast Node-Counts by Label</a></h4>
<div class="paragraph">
<p>Counts by label are quickly provided by the counts-store, but only if they are the the single thing in the query, like</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (:Person) RETURN count(*);</code></pre>
</div>
</div>
<div class="paragraph">
<p>It also works to combine several with <code>UNION ALL</code>, but not via <code>WITH</code></p>
</div>
<div class="listingblock">
<div class="title">Doesn&#8217;t work</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (:Person) WITH count(*) as people
MATCH (:Movie) RETURN people, count(*) as movies;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Works</div>
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">MATCH (:Person) RETURN count(*)
UNION ALL
MATCH (:Movie) RETURN count(*);</code></pre>
</div>
</div>
<div class="paragraph">
<p>But with <code>apoc.cypher.run</code> we can construct the statement and run each of them individually, so it completes in a few ms.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">call db.labels() yield label
call apoc.cypher.run("match (:`"+label+"`) return count(*) as count", null) yield value
return label, value.count as count</code></pre>
</div>
</div>
<div class="paragraph">
<p>You can use a similar approach to get the property-keys per label:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cypher" data-lang="cypher">CALL db.labels() yield label
call apoc.cypher.run("MATCH (n:`"+label+"`) RETURN keys(n) as keys LIMIT 1",null) yield value
RETURN label, value.keys as keys</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_job_management_and_periodic_execution"><a class="link" href="#_job_management_and_periodic_execution">Job management and periodic execution</a></h3>
<div class="sect3">
<h4 id="_introduction_asynchronous_transactional_execution"><a class="link" href="#_introduction_asynchronous_transactional_execution">Introduction asynchronous transactional execution</a></h4>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<div class="title">Note</div>
</td>
<td class="content">
this document is work in progress
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>Cypher is great for querying graphs and importing and updating graph structures.
While during imports you can use <code>PERIODIC COMMIT</code> to control transaction sizes in memory,
for other graph refactorings it&#8217;s not that easy to commit transactions regularly to free memory for new update state.</p>
</div>
<div class="paragraph">
<p>Also sometimes you want to schedule execution of Cypher statements to run regularly in the background or asynchronously ("fire &amp; forget").</p>
</div>
<div class="paragraph">
<p>The <code>apoc.periodic.*</code> procedures provide such capabilities.</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="footer">
<div id="footer-text">
Last updated 2017-03-10 13:51:01 +01:00
</div>
</div>
</body>
</html>
